{
  "RW-00-FOOL": {
    "name": "The Fool",
    "description": "Numbered 0 of the Major Arcana, The Fool stands at the threshold of all journeys. In the Rider–Waite image, a bright sun crowns a sky of possibility as a carefree traveler steps toward a cliff, a white rose of innocence in one hand and a light knapsack over the shoulder. A small white dog leaps at his heels, both warning and blessing, while distant mountains glimmer with untrodden paths. The air is crisp, the world unwritten, and the moment is pure potential — a breath held just before the leap.",
    "keywords": {
      "upright": [
        "beginnings",
        "innocence",
        "spontaneity",
        "adventure",
        "faith"
      ],
      "reversed": [
        "recklessness",
        "naivety",
        "carelessness",
        "hesitation",
        "missteps"
      ]
    },
    "meanings": {
      "upright": "A fresh chapter beckons with trust and open-hearted curiosity. Take the leap, gather only what you need, and let experience be your teacher.",
      "reversed": "Pause before stepping off the edge. Fear, folly, or avoidable risks ask for grounded awareness and a plan."
    },
    "category_meanings": {
      "love": {
        "upright": "New romance or a playful renewal of an existing bond invites openness and delight.",
        "reversed": "Rushing in or ignoring red flags may lead to avoidable heartache; slow down and check your footing."
      },
      "career": {
        "upright": "A venture, role, or project begins — be bold, learn fast, and trust your initiative.",
        "reversed": "Impulsive moves or unclear goals could derail progress; clarify direction and prepare."
      },
      "finance": {
        "upright": "Opportunity arrives with a light, optimistic touch; start small and stay flexible.",
        "reversed": "Risky spending or speculation needs restraint; protect essentials first."
      },
      "health": {
        "upright": "Try a fresh routine or joyful movement to revive energy and spirit.",
        "reversed": "Avoid reckless choices; listen to your body and establish supportive habits."
      },
      "spiritual": {
        "upright": "Answer the call of wonder and step into the unknown with faith.",
        "reversed": "Feeling unmoored signals a need for grounding practices and gentle guidance."
      }
    },
    "version": "1.0.0"
  },
  "RW-01-MAGICIAN": {
    "name": "The Magician",
    "description": "Number I of the Major Arcana, The Magician channels heaven to earth. In the Rider–Waite image, he stands before a table set with wand, cup, sword, and pentacle — the four suits and elements — with one hand raised to the sky and the other pointing to the ground, declaring “as above, so below.” An infinity sign hovers over his head, a serpent-belt bites its tail around his waist, and a garden of red roses and white lilies blooms with focused intention. This is the spark of manifestation, skill married to will, and the brilliance of a mind aligned with purpose.",
    "keywords": {
      "upright": [
        "manifestation",
        "willpower",
        "resourcefulness",
        "focus",
        "skill"
      ],
      "reversed": [
        "manipulation",
        "untapped potential",
        "scattered energy",
        "trickery",
        "miscommunication"
      ]
    },
    "meanings": {
      "upright": "You have everything needed to bring an idea into form. Focus your will, use your tools, and act with clear intention.",
      "reversed": "Power leaks through distraction or misalignment; beware of smoke and mirrors. Reclaim focus and ethics before proceeding."
    },
    "category_meanings": {
      "love": {
        "upright": "Magnetic communication and chemistry grow a bond; say what you mean and create what you desire together.",
        "reversed": "Mixed signals or subtle manipulation erode trust; restore honesty and balanced give-and-take."
      },
      "career": {
        "upright": "Pitch, present, and lead — your skills land when delivered with precision and confidence.",
        "reversed": "Overpromising, disorganization, or office politics drain momentum; refine your message and methods."
      },
      "finance": {
        "upright": "Strategic planning and savvy tools help money work for you.",
        "reversed": "Beware of schemes or unclear terms; read the fine print and consolidate energy."
      },
      "health": {
        "upright": "A focused regimen, expert guidance, and consistent practice yield results.",
        "reversed": "Scattered approaches or miracle fixes backfire; simplify and commit to one clear plan."
      },
      "spiritual": {
        "upright": "Ritual, intention, and mindful action align inner vision with outer reality.",
        "reversed": "Ego tricks or spiritual bypassing obscure truth; ground your practice in integrity."
      }
    },
    "version": "1.0.0"
  },
  "RW-02-HIGH_PRIESTESS": {
    "name": "The High Priestess",
    "description": "Number II of the Major Arcana, The High Priestess guards the threshold of inner knowing. In the Rider–Waite image, she sits between the black and white pillars marked B and J, with a veil of pomegranates and palms behind her and the sea glimmering beyond. A lunar crown rests upon her brow, a crescent moon lies at her feet, and a partially hidden scroll marked TORA peeks from her robes. She is silence, mystery, and the cool depth of intuition — the wisdom that arrives when we listen beneath the noise.",
    "keywords": {
      "upright": [
        "intuition",
        "mystery",
        "inner knowledge",
        "stillness",
        "subconscious"
      ],
      "reversed": [
        "secrets",
        "disconnection",
        "repressed feelings",
        "hidden motives",
        "superficiality"
      ]
    },
    "meanings": {
      "upright": "Trust the quiet voice within and observe without forcing. The answer ripens in stillness and reveals itself in time.",
      "reversed": "Intuition is muffled by doubt or noise, and something remains concealed. Step back, clear interference, and ask for truth."
    },
    "category_meanings": {
      "love": {
        "upright": "A subtle, soulful bond deepens through patience and attentive listening.",
        "reversed": "Unspoken needs or secrets create distance; invite gentle, honest conversation."
      },
      "career": {
        "upright": "Read the room, research quietly, and let insight guide strategic timing.",
        "reversed": "Office undercurrents and hidden agendas call for boundaries and discernment."
      },
      "finance": {
        "upright": "Follow informed intuition; investigate details before committing funds.",
        "reversed": "Opaque terms or missing information; delay decisions until clarity is certain."
      },
      "health": {
        "upright": "Notice subtle signals and cycles; rest, reflect, and support your nervous system.",
        "reversed": "Ignoring symptoms or burying stress; seek qualified insight and slow the pace."
      },
      "spiritual": {
        "upright": "Meditation, dreams, and sacred study open a quiet doorway to the divine.",
        "reversed": "Spiritual avoidance or confusion suggests returning to simple, steady practice."
      }
    },
    "version": "1.0.0"
  },
  "RW-03-EMPRESS": {
    "name": "The Empress",
    "description": "Number III of the Major Arcana, The Empress is the lush heart of creation. In the Rider–Waite card she reclines upon cushions near a field of golden wheat, clad in a pomegranate-patterned gown, with a crown of twelve stars circling her head. A forest and gentle stream flow behind her, and the shield of Venus rests nearby, emblem of love and fertility. She is the warmth of growth, the body’s wisdom, and the art of bringing ideas into abundant life.",
    "keywords": {
      "upright": [
        "abundance",
        "nurturing",
        "creativity",
        "sensuality",
        "growth"
      ],
      "reversed": [
        "smothering",
        "creative block",
        "dependency",
        "neglect",
        "stagnation"
      ]
    },
    "meanings": {
      "upright": "Nurture what you love and let it flourish. Beauty, comfort, and creativity multiply when tended with patience and care.",
      "reversed": "Overgiving or undernourishing throws growth off balance. Refill your own well, remove blocks, and restore natural rhythms."
    },
    "category_meanings": {
      "love": {
        "upright": "Affection, tenderness, and devotion deepen bonds; prioritize quality time and care.",
        "reversed": "Clinginess or emotional neglect strains connection; seek balance between giving and receiving."
      },
      "career": {
        "upright": "Creative projects blossom through collaboration and steady cultivation.",
        "reversed": "Burnout or stifled expression; set boundaries and give ideas room to breathe."
      },
      "finance": {
        "upright": "Resources grow through sensible stewardship and fertile opportunities.",
        "reversed": "Overspending for comfort or scarcity thinking; recalibrate habits and invest in sustainability."
      },
      "health": {
        "upright": "Gentle routines, nourishment, and nature support robust wellbeing.",
        "reversed": "Ignoring body signals or overindulgence; reestablish supportive self-care."
      },
      "spiritual": {
        "upright": "Honor embodiment as sacred; creativity becomes a devotional path.",
        "reversed": "Disconnection from the body dims intuition; return to sensory practices and gratitude."
      }
    },
    "version": "1.0.0"
  },
  "RW-04-EMPEROR": {
    "name": "The Emperor",
    "description": "Number IV of the Major Arcana, The Emperor anchors order and authority. In the Rider–Waite image, he sits upon a stone throne adorned with rams’ heads, clad in red robes over armor, with barren mountains rising behind him. He holds an orb and an ankh-topped scepter, his crown and white beard signaling seasoned rule and clear command. This is structure, protection, and the confidence to set firm boundaries in service of stability.",
    "keywords": {
      "upright": [
        "structure",
        "authority",
        "stability",
        "leadership",
        "discipline"
      ],
      "reversed": [
        "rigidity",
        "domination",
        "inflexibility",
        "power struggle",
        "lack of control"
      ]
    },
    "meanings": {
      "upright": "Define the plan, assume responsibility, and lead with steadiness. Systems and strategy bring lasting security.",
      "reversed": "Control without compassion becomes brittle. Loosen the grip, renegotiate power, and rebuild trust."
    },
    "category_meanings": {
      "love": {
        "upright": "Commitment strengthens through reliability and clear agreements.",
        "reversed": "Overcontrol or emotional distance harms connection; practice empathy and mutual respect."
      },
      "career": {
        "upright": "Step into leadership, set priorities, and create durable frameworks.",
        "reversed": "Micromanagement or resistance to feedback stalls progress; adapt and delegate."
      },
      "finance": {
        "upright": "Prudent planning, budgets, and safeguards produce long-term stability.",
        "reversed": "Overly tight control or chaotic spending; balance discipline with flexibility."
      },
      "health": {
        "upright": "Structured routines and consistent effort improve strength and resilience.",
        "reversed": "All-or-nothing approaches backfire; adopt sustainable practices."
      },
      "spiritual": {
        "upright": "Ritual and disciplined study ground your path.",
        "reversed": "Dogmatism constricts growth; make space for humility and discovery."
      }
    },
    "version": "1.0.0"
  },
  "RW-05-HIEROPHANT": {
    "name": "The Hierophant",
    "description": "Number V of the Major Arcana, The Hierophant is the keeper of tradition and sacred teaching. In the Rider–Waite card, a robed figure wearing a triple crown raises a hand in blessing and holds a triple-cross scepter, while two acolytes kneel before him and crossed keys rest at his feet. Pillars frame a sacred space, signaling lineage, doctrine, and the transmission of wisdom. This is the bridge between earth and the holy, inviting learning, community, and meaningful rites.",
    "keywords": {
      "upright": [
        "tradition",
        "spiritual guidance",
        "conformity",
        "education",
        "ritual"
      ],
      "reversed": [
        "nonconformity",
        "questioning dogma",
        "rebellion",
        "personal belief",
        "unorthodox"
      ]
    },
    "meanings": {
      "upright": "Seek counsel from trusted teachers and time-honored methods. Belonging and structure can guide you through complexity.",
      "reversed": "Rules without spirit constrain growth; challenge stale forms and honor your authentic path."
    },
    "category_meanings": {
      "love": {
        "upright": "Shared values, commitment, and possibly formal milestones strengthen the bond.",
        "reversed": "Different beliefs or resistance to labels stirs friction; define your own terms together."
      },
      "career": {
        "upright": "Mentorship, certification, or established systems advance your role.",
        "reversed": "Bureaucracy or rigid policy stifles initiative; propose thoughtful reforms or seek a better fit."
      },
      "finance": {
        "upright": "Conservative strategies, reputable institutions, and expert advice protect assets.",
        "reversed": "Break from unhelpful financial habits or norms; choose approaches aligned with your values."
      },
      "health": {
        "upright": "Follow proven protocols and professional guidance for steady progress.",
        "reversed": "A one-size-fits-all plan may fail; personalize your approach within safe parameters."
      },
      "spiritual": {
        "upright": "Study, ritual, and community practice deepen faith and understanding.",
        "reversed": "Direct experience becomes the teacher; question dogma and listen within."
      }
    },
    "version": "1.0.0"
  },
  "RW-06-LOVERS": {
    "name": "The Lovers",
    "description": "Number VI of the Major Arcana, The Lovers reveal union and choice. In the Rider–Waite scene, the angel Raphael hovers beneath a radiant sun as two figures, reminiscent of Adam and Eve, stand before trees — the serpent coiling around the fruit behind the woman, and flames rising behind the man. A mountain rises between them, suggesting a path that requires conscious alignment. Love, values, and decisions meet under a blessing that asks for wholehearted truth.",
    "keywords": {
      "upright": [
        "love",
        "union",
        "choice",
        "alignment",
        "partnership"
      ],
      "reversed": [
        "disharmony",
        "misalignment",
        "temptation",
        "indecision",
        "imbalance"
      ]
    },
    "meanings": {
      "upright": "Choose with your whole heart and let your actions reflect your values. Partnership and harmony arise from honest alignment.",
      "reversed": "Mixed motives or fear of choice create tension. Revisit your values and realign before committing."
    },
    "category_meanings": {
      "love": {
        "upright": "A blessed connection deepens through authenticity, mutual care, and open dialogue.",
        "reversed": "Crossed signals, triangles, or avoidance of choice strain the bond; clarify needs and boundaries."
      },
      "career": {
        "upright": "Collaborations thrive when values match; choose projects that reflect true priorities.",
        "reversed": "Conflicts of interest or unclear agreements; renegotiate terms or step away."
      },
      "finance": {
        "upright": "Make value-based financial decisions, possibly in partnership; harmony supports prosperity.",
        "reversed": "Tempting but misaligned offers; avoid choices that compromise core principles."
      },
      "health": {
        "upright": "Balanced habits sustained by supportive relationships improve wellbeing.",
        "reversed": "Inconsistency or self-sabotage calls for recommitment to aligned routines."
      },
      "spiritual": {
        "upright": "Union of head and heart opens a path of sacred connection.",
        "reversed": "Inner division clouds guidance; reconcile conflicting desires through honest reflection."
      }
    },
    "version": "1.0.0"
  },
  "RW-07-CHARIOT": {
    "name": "The Chariot",
    "description": "Number VII of the Major Arcana, The Chariot triumphs through directed will. In the Rider–Waite card, an armored charioteer stands beneath a starry canopy, crowned with a laurel and star, wielding a wand as two sphinxes — one black, one white — rest poised to pull the vehicle. Crescent moons adorn his shoulders, a square breastplate anchors him, and a city lies behind as he advances toward open roads. Mastery comes from harnessing opposing forces and steering them toward a single aim.",
    "keywords": {
      "upright": [
        "determination",
        "victory",
        "control",
        "willpower",
        "direction"
      ],
      "reversed": [
        "loss of control",
        "scattered focus",
        "aggression",
        "obstacles",
        "stalling"
      ]
    },
    "meanings": {
      "upright": "Claim the reins and move with purpose. Discipline and resolve carry you past obstacles into decisive progress.",
      "reversed": "Forces pull in different directions or will turns forceful; recalibrate, regain balance, and choose your lane."
    },
    "category_meanings": {
      "love": {
        "upright": "Shared goals and clear boundaries propel the relationship forward.",
        "reversed": "Power struggles or conflicting priorities stall momentum; slow down and realign intentions."
      },
      "career": {
        "upright": "Drive, strategy, and confident leadership deliver wins and recognition.",
        "reversed": "Overextension or scattered tasks sap results; prioritize and manage pace."
      },
      "finance": {
        "upright": "Focused budgeting and targeted action move you toward financial milestones.",
        "reversed": "Impulsive purchases or competing goals derail plans; tighten controls and set a clear course."
      },
      "health": {
        "upright": "Consistency in training and routine produces tangible improvements.",
        "reversed": "Pushing too hard or losing structure risks setbacks; adjust intensity and plan."
      },
      "spiritual": {
        "upright": "Will aligned with purpose becomes a sacred vehicle for growth.",
        "reversed": "Ego-driven striving obscures guidance; cultivate humility and centered intent."
      }
    },
    "version": "1.0.0"
  },
  "RW-08-STRENGTH": {
    "name": "Strength",
    "description": "Strength is Major Arcana VIII — the quiet power of grace in motion. In the Rider–Waite image, a serene woman in white gently closes the jaws of a golden lion; above her head floats the lemniscate, the sign of infinite spirit. A garland of roses circles her waist as distant mountains hold steady on the horizon. This is courage without cruelty, passion bridled by compassion, the tender mastery that tames the wild within.",
    "keywords": {
      "upright": [
        "inner strength",
        "compassion",
        "courage",
        "patience",
        "gentle control",
        "self-mastery"
      ],
      "reversed": [
        "self-doubt",
        "insecurity",
        "raw emotion",
        "force",
        "imbalance",
        "weakness"
      ]
    },
    "meanings": {
      "upright": "Calm, heart-centered courage overcomes brute force. You are invited to lead with compassion, trust your resilience, and channel passion into purposeful action.",
      "reversed": "Fear, frustration, or depleted confidence may be driving your choices. Step back, soothe the nervous system, and rebuild strength through kindness to yourself."
    },
    "category_meanings": {
      "love": {
        "upright": "Tenderness and trust soften defenses; love grows through patience and mutual respect.",
        "reversed": "Power struggles or jealousy flare when insecurity leads. Practice reassurance and avoid forcing outcomes."
      },
      "career": {
        "upright": "Steady leadership and calm under pressure. Your composed presence earns loyalty and progress.",
        "reversed": "Burnout or reactive decisions. Pace yourself and delegate before passion turns to volatility."
      },
      "finance": {
        "upright": "Responsible stewardship and disciplined choices strengthen long-term security.",
        "reversed": "Impulse spending or attempting to force quick gains. Create boundaries and restore financial confidence."
      },
      "health": {
        "upright": "Resilience grows through balanced routines, gentle movement, and self-compassion.",
        "reversed": "Stress is taxing your system. Slow down, soothe the body, and seek supportive practices."
      },
      "spiritual": {
        "upright": "Integrate instinct and spirit; the heart’s courage becomes your guide.",
        "reversed": "Doubt clouds your inner flame. Reconnect with practices that remind you of your inherent strength."
      }
    },
    "version": "1.0.0"
  },
  "RW-09-HERMIT": {
    "name": "The Hermit",
    "description": "The Hermit is Major Arcana IX — the lamp of truth held aloft in the night. A cloaked elder stands upon a snowy peak, staff in one hand and a lantern in the other, its six-pointed star glowing within. The world falls away to silence as he searches inward, a patient pilgrim of wisdom. His light is both invitation and boundary: a guide for those ready to walk the solitary path to insight.",
    "keywords": {
      "upright": [
        "introspection",
        "solitude",
        "wisdom",
        "guidance",
        "inner search",
        "contemplation"
      ],
      "reversed": [
        "isolation",
        "withdrawal",
        "loneliness",
        "misguidance",
        "avoiding reflection",
        "disconnection"
      ]
    },
    "meanings": {
      "upright": "Pause and turn inward; the answers you seek are lit by your own lantern. Solitude clarifies purpose and reveals the next step with quiet certainty.",
      "reversed": "Too much withdrawal can dim the light. Re-enter the world with what you’ve learned, or seek guidance if you feel unmoored."
    },
    "category_meanings": {
      "love": {
        "upright": "A need for reflective space strengthens authentic connection. Depth over drama.",
        "reversed": "Emotional distance or avoidance of intimacy. Share your inner world or risk growing apart."
      },
      "career": {
        "upright": "Independent study, research, or mentorship. Thoughtful strategy beats noise and haste.",
        "reversed": "Working in a silo or ignoring feedback. Seek counsel or collaboration to move forward."
      },
      "finance": {
        "upright": "Prudent, minimalist choices and careful analysis. Save, plan, and avoid trends.",
        "reversed": "Overly cautious or uninformed decisions. Consult a trusted advisor and recheck assumptions."
      },
      "health": {
        "upright": "Quiet routines, rest, and mindful reflection support healing.",
        "reversed": "Isolation may hinder wellbeing. Reach out and balance inner work with community care."
      },
      "spiritual": {
        "upright": "A profound inner quest; your intuition becomes the teacher.",
        "reversed": "Spiritual drift or navel-gazing. Ground insights in daily practice and service."
      }
    },
    "version": "1.0.0"
  },
  "RW-10-WHEEL": {
    "name": "Wheel of Fortune",
    "description": "Wheel of Fortune is Major Arcana X — the turning wheel of fate. In the clouds, a great wheel marked with TORA and alchemical glyphs spins; a sphinx sits poised atop, a serpent descends, and Anubis rises on the rim. Around them, the winged guardians of the four corners study their books. Fortune’s wheel promises cycles, chances, and a cosmos alive with motion; what rises must one day fall, and fallings rise again.",
    "keywords": {
      "upright": [
        "fate",
        "cycles",
        "change",
        "luck",
        "turning point",
        "karma"
      ],
      "reversed": [
        "resistance to change",
        "setbacks",
        "bad timing",
        "external forces",
        "clinging to control"
      ]
    },
    "meanings": {
      "upright": "Life shifts; a turning point arrives. Ride the cycle with flexibility and faith, and seize the openings that appear.",
      "reversed": "Stalled momentum or unwelcome twists invite patience. Loosen your grip, recalibrate, and wait for the wheel to crest again."
    },
    "category_meanings": {
      "love": {
        "upright": "Serendipity sparks connections or renews passion. Be open to the unexpected.",
        "reversed": "On–off patterns or mixed signals. Don’t force timing; let clarity develop."
      },
      "career": {
        "upright": "A change in role, fortune, or visibility. Adapt quickly to capitalize on opportunity.",
        "reversed": "Delays or market shifts. Revise plans and control what you can: skill, attitude, readiness."
      },
      "finance": {
        "upright": "Fluctuations and lucky breaks are possible. Diversify and ride the cycle wisely.",
        "reversed": "Unpredictability or losses. Avoid gambles; stabilize and plan for contingencies."
      },
      "health": {
        "upright": "Energy cycles upward; improvements through positive routine shifts.",
        "reversed": "Inconsistent progress. Small, steady habits reset the rhythm."
      },
      "spiritual": {
        "upright": "Synchronicities highlight your path; trust the orchestration.",
        "reversed": "Feeling at the mercy of fate. Reclaim agency through surrender and mindful choice."
      }
    },
    "version": "1.0.0"
  },
  "RW-11-JUSTICE": {
    "name": "Justice",
    "description": "Justice is Major Arcana XI — the measured heart of truth. A regal figure sits between gray pillars, scales balanced in the left hand and an upright sword in the right. A veil hangs behind, hinting at deeper realities, while the red robe signifies the courage to act fairly. This card is cause and effect, honesty and accountability, the steady mirror that shows what is and asks what must be done.",
    "keywords": {
      "upright": [
        "fairness",
        "truth",
        "accountability",
        "cause and effect",
        "law",
        "balance"
      ],
      "reversed": [
        "unfairness",
        "bias",
        "dishonesty",
        "avoidance of responsibility",
        "imbalance",
        "consequences"
      ]
    },
    "meanings": {
      "upright": "Align with truth and act with integrity. Decisions made now carry long echoes; weigh them with clarity and compassion.",
      "reversed": "Imbalance, partial truths, or evasions distort outcomes. Correct course, own your part, and seek transparency."
    },
    "category_meanings": {
      "love": {
        "upright": "Honest dialogue restores equilibrium. Agreements and boundaries strengthen trust.",
        "reversed": "One-sided effort or withheld truths. Clear the air before resentment hardens."
      },
      "career": {
        "upright": "Contracts, ethics, and fair procedures matter. Your credibility is your capital.",
        "reversed": "Office politics or skewed judgment. Document, advocate, and revisit the facts."
      },
      "finance": {
        "upright": "Balanced budgeting and fair deals. Read the fine print; act responsibly.",
        "reversed": "Disputes or hidden terms. Seek advice and rectify errors promptly."
      },
      "health": {
        "upright": "Balance routine and rest; consistency yields results.",
        "reversed": "Habits out of balance. Reassess inputs and sustain what supports equilibrium."
      },
      "spiritual": {
        "upright": "Live your values; truth becomes practice.",
        "reversed": "Cognitive dissonance. Realign beliefs and behavior with conscience."
      }
    },
    "version": "1.0.0"
  },
  "RW-12-HANGED_MAN": {
    "name": "The Hanged Man",
    "description": "The Hanged Man is Major Arcana XII — the still point between breaths. A figure hangs calmly upside down from a living tree, one leg crossed behind the other to form a four, a halo of enlightenment encircling his head. The world is inverted to invite a new view; surrender reveals what struggle obscures. This is the sacred pause where insight ripens.",
    "keywords": {
      "upright": [
        "surrender",
        "new perspective",
        "pause",
        "letting go",
        "sacrifice",
        "liminal space"
      ],
      "reversed": [
        "stalling",
        "indecision",
        "martyrdom",
        "avoidance",
        "delay",
        "rigidity"
      ]
    },
    "meanings": {
      "upright": "Release urgency and accept suspension. By letting go, you see differently and discover the path that effort alone could not reveal.",
      "reversed": "Resistance prolongs the pause. Stop sacrificing yourself without purpose; choose, or consciously wait with intention."
    },
    "category_meanings": {
      "love": {
        "upright": "A shift in perspective heals patterns. Patience and empathy renew connection.",
        "reversed": "Mixed signals or a stalemate. Don’t martyr your needs; seek clarity or step back."
      },
      "career": {
        "upright": "Reframe goals and strategies. Creative solutions arise when you suspend assumptions.",
        "reversed": "Project delays or indecision. Set criteria, make a call, or consciously put it on hold."
      },
      "finance": {
        "upright": "Pause big moves; assess value and trade-offs with fresh eyes.",
        "reversed": "Money stuck due to avoidance. Untangle the knot with a clear plan."
      },
      "health": {
        "upright": "Rest and gentle stretches; healing deepens through surrender not strain.",
        "reversed": "Ignoring signs or over-sacrificing wellbeing. Commit to one supportive change."
      },
      "spiritual": {
        "upright": "A mystical inversion — surrender becomes revelation.",
        "reversed": "Clinging to old views blocks insight. Practice letting go, one belief at a time."
      }
    },
    "version": "1.0.0"
  },
  "RW-13-DEATH": {
    "name": "Death",
    "description": "Death is Major Arcana XIII — the rider who clears the field for dawn. A skeletal figure in black armor advances on a white horse, bearing a banner with the white rose of purification. A king lies fallen; a child, a maiden, and a bishop behold the procession. Beyond, the sun rises between twin towers. This is not annihilation but inevitability: endings that usher in the next beginning.",
    "keywords": {
      "upright": [
        "transformation",
        "endings",
        "release",
        "transition",
        "rebirth",
        "inevitability"
      ],
      "reversed": [
        "resistance to change",
        "stagnation",
        "fear of endings",
        "clinging",
        "prolonged transition"
      ]
    },
    "meanings": {
      "upright": "A chapter closes so a truer one can begin. Let what is complete fall away; the horizon holds new light.",
      "reversed": "Holding on tight prolongs the ache. Make space for change, and grief will turn into growth."
    },
    "category_meanings": {
      "love": {
        "upright": "A relationship transforms or completes. Honest endings or powerful renewals are possible.",
        "reversed": "Avoiding closure or change keeps love in limbo. Name the truth and choose."
      },
      "career": {
        "upright": "Job shifts, restructures, or purposeful exits clear the way for alignment.",
        "reversed": "Fear of transition stalls progress. Prepare, then step through the door."
      },
      "finance": {
        "upright": "Rebalancing resources and cutting losses. Simplify to rebuild stronger.",
        "reversed": "Clinging to sunk costs. Accept the write-off and reorient."
      },
      "health": {
        "upright": "Ending harmful habits; embracing renewal supports vitality.",
        "reversed": "Resistance to needed changes. Gentle, consistent shifts are key."
      },
      "spiritual": {
        "upright": "Ego-shedding and deep renewal. A profound rite of passage.",
        "reversed": "Fear of letting go curtails growth. Trust the passage and its promise."
      }
    },
    "version": "1.0.0"
  },
  "RW-14-TEMPERANCE": {
    "name": "Temperance",
    "description": "Temperance is Major Arcana XIV — the art of sacred blending. A radiant angel stands with one foot on land and one in water, pouring a shining stream between two cups in a perfect arc. A path leads toward a golden crown on the horizon. This is harmony through moderation, alchemy through patience, the healing middle way that marries opposites.",
    "keywords": {
      "upright": [
        "balance",
        "moderation",
        "alchemy",
        "patience",
        "harmony",
        "healing"
      ],
      "reversed": [
        "excess",
        "imbalance",
        "discord",
        "impatience",
        "overindulgence",
        "fragmentation"
      ]
    },
    "meanings": {
      "upright": "Blend, don’t battle. With patience and care, disparate elements find a graceful mix that sustains long-term peace and progress.",
      "reversed": "Too much or too little unsettles the whole. Recalibrate the recipe; small adjustments restore flow."
    },
    "category_meanings": {
      "love": {
        "upright": "Compromise and emotional regulation deepen intimacy.",
        "reversed": "Heated extremes or withdrawal. Meet in the middle and slow the tempo."
      },
      "career": {
        "upright": "Teamwork, cross-skills, and steady process create elegant results.",
        "reversed": "Overextension or siloed efforts. Streamline and coordinate."
      },
      "finance": {
        "upright": "Balanced budgeting and diversified plans. Slow and steady wins.",
        "reversed": "Spending swings or unsustainable cuts. Aim for moderate, consistent choices."
      },
      "health": {
        "upright": "Holistic routines and gradual changes promote healing.",
        "reversed": "All-or-nothing habits. Seek sustainable, gentle rhythm."
      },
      "spiritual": {
        "upright": "Integration of body, mind, and spirit; a calm, continuous practice.",
        "reversed": "Fragmented focus. Reunite parts of yourself through simple daily rituals."
      }
    },
    "version": "1.0.0"
  },
  "RW-15-DEVIL": {
    "name": "The Devil",
    "description": "The Devil is Major Arcana XV — the shadow enthroned. A horned figure with bat wings and an inverted pentagram presides over a chained couple whose bonds are loose enough to remove. Flames lick the black backdrop, hinting at appetites and fear. This card reveals bondage chosen or forgotten, the seduction of materialism and the power we give away when we forget we can choose differently.",
    "keywords": {
      "upright": [
        "bondage",
        "shadow",
        "materialism",
        "temptation",
        "addiction",
        "attachment"
      ],
      "reversed": [
        "liberation",
        "awareness",
        "detachment",
        "recovery",
        "reclaiming power",
        "breaking chains"
      ]
    },
    "meanings": {
      "upright": "Confront the habits, cravings, or contracts that keep you small. Seeing the chain is the first act of freedom.",
      "reversed": "The lock clicks open; you are ready to step away from what binds. Commit to the path of conscious choice."
    },
    "category_meanings": {
      "love": {
        "upright": "Magnetism with strings attached: jealousy, control, or unhealthy patterns.",
        "reversed": "Healing codependency and renegotiating consent and boundaries."
      },
      "career": {
        "upright": "Golden handcuffs, toxic cultures, or workaholism. Name the cost.",
        "reversed": "Detaching from corrosive dynamics; redefining success on your terms."
      },
      "finance": {
        "upright": "Debt cycles or compulsive spending; allure of status purchases.",
        "reversed": "Budget clarity and debt recovery; values-led money choices."
      },
      "health": {
        "upright": "Habits that undermine wellbeing. Seek support and honest inventory.",
        "reversed": "Breaking patterns and rebuilding resilience through steady care."
      },
      "spiritual": {
        "upright": "Shadow work: face fear, shame, and desire without judgment.",
        "reversed": "Integration and release; compassion dissolves old chains."
      }
    },
    "version": "1.0.0"
  },
  "RW-16-TOWER": {
    "name": "The Tower",
    "description": "The Tower is Major Arcana XVI — the lightning that splits illusion. A crowned tower is struck and burning; figures tumble from its heights as flames shoot from shattered windows. The sky is black with shock, yet the strike is also revelation: false structures fall so truth can stand. Sudden, uncompromising change clears the way for what is real.",
    "keywords": {
      "upright": [
        "upheaval",
        "revelation",
        "sudden change",
        "crisis",
        "awakening",
        "breakdown"
      ],
      "reversed": [
        "averted disaster",
        "resistance to change",
        "internal upheaval",
        "fear of collapse",
        "rebuilding"
      ]
    },
    "meanings": {
      "upright": "Expect a jolt that rearranges everything. Though unsettling, this liberation dismantles what could not hold.",
      "reversed": "You may be delaying the inevitable or processing the shock within. Choose honesty and rebuild on bedrock."
    },
    "category_meanings": {
      "love": {
        "upright": "A truth bomb lands; dynamics change overnight. Authenticity first, then repair or release.",
        "reversed": "Tiptoeing around issues. Have the hard conversation to prevent a bigger break."
      },
      "career": {
        "upright": "Shake-ups, restructures, or abrupt pivots. Stay grounded and act decisively.",
        "reversed": "Quiet upheaval behind the scenes. Prepare, simplify, and protect essentials."
      },
      "finance": {
        "upright": "Unexpected expenses or market shocks. Stabilize, triage, and rebuild.",
        "reversed": "Near-miss or manageable loss. Learn and fortify reserves."
      },
      "health": {
        "upright": "A wake-up call to change unsustainable patterns.",
        "reversed": "Integration after shock. Create supportive, steady routines."
      },
      "spiritual": {
        "upright": "Shattering of false beliefs; raw clarity arrives.",
        "reversed": "Gentler deconstruction. Let go before life rips it away."
      }
    },
    "version": "1.0.0"
  },
  "RW-17-STAR": {
    "name": "The Star",
    "description": "The Star is Major Arcana XVII — the quiet balm after the storm. A nude figure kneels by a pool, pouring water into the earth and back to the source, while a great eight-pointed star shines among seven smaller lights. A bird rests in a nearby tree; the night is gentle and vast. Hope, healing, and inspiration gather here like cool light upon the skin.",
    "keywords": {
      "upright": [
        "hope",
        "healing",
        "serenity",
        "inspiration",
        "faith",
        "renewal"
      ],
      "reversed": [
        "pessimism",
        "doubt",
        "discouragement",
        "disconnection",
        "creative block",
        "loss of faith"
      ]
    },
    "meanings": {
      "upright": "Trust the slow return of light. Your spirit renews, creativity flows, and guidance arrives as calm assurance.",
      "reversed": "A dimming of hope calls for gentle care. Refill your well; seek beauty, rest, and honest encouragement."
    },
    "category_meanings": {
      "love": {
        "upright": "Tender healing and authentic vulnerability. A relationship can mend or deepen in truth.",
        "reversed": "Guarded hearts and low morale. Rebuild trust with small, consistent kindness."
      },
      "career": {
        "upright": "A guiding vision and receptive audience. Share your authentic voice.",
        "reversed": "Creative fatigue or self-doubt. Pace yourself and reconnect to purpose."
      },
      "finance": {
        "upright": "Gradual recovery and wise planning. Optimism rooted in realism.",
        "reversed": "Discouragement skews choices. Reassess calmly and set modest goals."
      },
      "health": {
        "upright": "Restorative energies and gentle therapies aid recovery.",
        "reversed": "Fatigue or low mood. Prioritize sleep, hydration, and supportive care."
      },
      "spiritual": {
        "upright": "A sense of being guided; faith becomes a steady glow.",
        "reversed": "Spiritual dryness. Return to simple practices that spark wonder."
      }
    },
    "version": "1.0.0"
  },
  "RW-18-MOON": {
    "name": "The Moon",
    "description": "The Moon is Major Arcana XVIII — the dreaming road between towers. A pale moon gazes down, shedding drops of influence; a dog and a wolf howl from either side of a winding path, while a crayfish rises from the water’s edge. This is the realm of tides and instincts, of shadows that teach through mystery. Not all is as it seems, yet intuition knows the way.",
    "keywords": {
      "upright": [
        "illusion",
        "intuition",
        "dreams",
        "fear",
        "subconscious",
        "uncertainty"
      ],
      "reversed": [
        "clarity emerging",
        "releasing fear",
        "truth revealed",
        "confusion lifting",
        "inner guidance"
      ]
    },
    "meanings": {
      "upright": "Feel into the fog rather than forcing clarity. Trust signals from dreams, body, and emotion; move gently and verify before acting.",
      "reversed": "The mist thins. Fears lose hold as you name them, and a truer picture comes into view."
    },
    "category_meanings": {
      "love": {
        "upright": "Heightened sensitivity and mixed messages. Seek emotional safety and honest check-ins.",
        "reversed": "Misunderstandings clear; secrets surface. Proceed with calm transparency."
      },
      "career": {
        "upright": "Ambiguous signals at work. Research, document, and trust your gut without leaping.",
        "reversed": "Hidden factors revealed. Plans firm up as doubts resolve."
      },
      "finance": {
        "upright": "Unclear expenses or fine print. Avoid speculation; illuminate details.",
        "reversed": "Better visibility enables sound decisions and careful budgeting."
      },
      "health": {
        "upright": "Mind–body sensitivity is high. Gentle routines and stress reduction help.",
        "reversed": "Anxiety eases as you find reliable information and support."
      },
      "spiritual": {
        "upright": "Deep intuitive work, shadow exploration, potent dreams.",
        "reversed": "Integration of insights; intuition becomes clearer and calmer."
      }
    },
    "version": "1.0.0"
  },
  "RW-19-SUN": {
    "name": "The Sun",
    "description": "The Sun is Major Arcana XIX — the bright heart of life. A joyful child rides a white horse beneath a radiant sun, waving a red banner of vitality. Sunflowers bloom over a golden wall, turning their faces to warmth and clarity. This is success made simple, the exuberant yes that illuminates your path and nourishes growth.",
    "keywords": {
      "upright": [
        "joy",
        "success",
        "vitality",
        "clarity",
        "warmth",
        "optimism"
      ],
      "reversed": [
        "temporary clouds",
        "delayed success",
        "overexuberance",
        "ego glare",
        "inner child healing"
      ]
    },
    "meanings": {
      "upright": "Confidence, clarity, and celebration. Step into visibility and let your authentic light be seen.",
      "reversed": "Joy is present but partially obscured. Simplify, recalibrate expectations, and tend your inner radiance."
    },
    "category_meanings": {
      "love": {
        "upright": "Playfulness and trust flourish; a relationship thrives in openness.",
        "reversed": "Small egos or mixed priorities dim the glow. Return to simple shared joys."
      },
      "career": {
        "upright": "Recognition, successful launches, or a breakthrough. Lead with transparency.",
        "reversed": "Minor delays or overpromising. Align results with clear, realistic goals."
      },
      "finance": {
        "upright": "Improved stability and confident planning. Growth through clear strategy.",
        "reversed": "Expenses around fun or image creep up. Keep the light bright and the budget grounded."
      },
      "health": {
        "upright": "Vital energy rises; time outdoors and movement nourish.",
        "reversed": "Energy dips or burnout signals. Rest restores your shine."
      },
      "spiritual": {
        "upright": "A warm, heart-centered awakening; gratitude overflows.",
        "reversed": "Reconnect with joy as a practice; let simple presence be your teacher."
      }
    },
    "version": "1.0.0"
  },
  "RW-20-JUDGEMENT": {
    "name": "Judgement",
    "description": "Judgement is Major Arcana XX — the trumpet of awakening. An angel sounds a horn from the sky, and figures rise from coffins, arms lifted toward a new day, mountains distant and clear. This is the call to account and to purpose: a reckoning that frees you from old stories and invites you into your true work.",
    "keywords": {
      "upright": [
        "rebirth",
        "calling",
        "absolution",
        "awakening",
        "evaluation",
        "redemption"
      ],
      "reversed": [
        "self-criticism",
        "doubt",
        "denial",
        "fear of change",
        "stuck past",
        "hesitation"
      ]
    },
    "meanings": {
      "upright": "Hear the call and answer. Reflect honestly, forgive what has been, and step into a larger life.",
      "reversed": "Harsh self-judgment or delayed decisions keep you in limbo. Choose compassion and commit to the next chapter."
    },
    "category_meanings": {
      "love": {
        "upright": "Honest reckoning renews or completes a bond. Forgiveness and clarity lead forward.",
        "reversed": "Rehashing old wounds without resolution. Decide to heal, or to release."
      },
      "career": {
        "upright": "A vocation clarifies; promotions, pivots, or public moments arrive.",
        "reversed": "Second-guessing your path. Assess, decide, and take the step."
      },
      "finance": {
        "upright": "Account reviews, debt resolutions, or settlements. Clean the slate.",
        "reversed": "Avoiding financial reality. Face the numbers and plan redemption."
      },
      "health": {
        "upright": "Renewal after a period of strain; lifestyle decisions bring fresh energy.",
        "reversed": "Inconsistency stalls progress. Commit to clear, compassionate routines."
      },
      "spiritual": {
        "upright": "A spiritual calling or initiation. You awaken to purpose.",
        "reversed": "Muted inner voice. Create space to listen and respond."
      }
    },
    "version": "1.0.0"
  },
  "RW-21-WORLD": {
    "name": "The World",
    "description": "The World is Major Arcana XXI — the wreath of completion. A dancer moves within a laurel oval, holding twin wands, draped in a violet scarf that flows like infinity. In the four corners, the bull, lion, eagle, and angel watch — the fixed signs, the elements, the whole. This is fulfillment and integration, the journey become a circle and a doorway.",
    "keywords": {
      "upright": [
        "completion",
        "integration",
        "fulfillment",
        "wholeness",
        "mastery",
        "travel"
      ],
      "reversed": [
        "incomplete",
        "delays",
        "lack of closure",
        "loose ends",
        "fragmentation",
        "hesitation"
      ]
    },
    "meanings": {
      "upright": "A cycle concludes in triumph. Celebrate your growth, share your gifts, and step through to the next level.",
      "reversed": "One last thread needs weaving. Address the unfinished piece and the circle will close."
    },
    "category_meanings": {
      "love": {
        "upright": "A relationship reaches a mature, harmonious phase; for singles, readiness to meet as a whole person.",
        "reversed": "Old baggage delays intimacy. Seek closure and integration before advancing."
      },
      "career": {
        "upright": "Successful completion, graduation, or global reach. Your skills cohere into mastery.",
        "reversed": "Project stalls near the finish. Tighten details and align stakeholders."
      },
      "finance": {
        "upright": "Long-term goals culminate; diversified stability and confident planning.",
        "reversed": "Outstanding obligations or scattered accounts. Consolidate and finalize."
      },
      "health": {
        "upright": "Holistic wellbeing; balanced body and mind.",
        "reversed": "A missing piece in the routine. Integrate rest, movement, and nourishment."
      },
      "spiritual": {
        "upright": "Integration of lessons; belonging to the greater web.",
        "reversed": "Partial understanding. Reflect, synthesize, and embody your learning."
      }
    },
    "version": "1.0.0"
  },
  "RW-ACE-WANDS": {
    "name": "Ace of Wands",
    "description": "The Ace of Wands opens the suit of Fire with a hand emerging from a cloud, offering a living wand that sprouts fresh green leaves. Below, a river winds through fertile fields toward distant mountains and a small castle—promise glimmering on the horizon. This is the raw spark of creation, the first flare of passion and possibility, a sacred ignition that urges you to begin and let momentum catch flame.",
    "keywords": {
      "upright": [
        "inspiration",
        "initiation",
        "passion",
        "growth",
        "creative spark",
        "potential",
        "momentum"
      ],
      "reversed": [
        "blocked creativity",
        "delays",
        "false start",
        "hesitation",
        "scattered energy",
        "burnout"
      ]
    },
    "meanings": {
      "upright": "A fresh surge of energy arrives, inviting you to start, create, and move. This card signals ignition—follow the heat and trust the first bold step. Doors open when you answer inspiration with action.",
      "reversed": "The spark sputters: timing, fear, or misalignment may be stalling momentum. Refocus your energy, clear distractions, and rekindle purpose before pushing forward."
    },
    "category_meanings": {
      "love": {
        "upright": "Magnetic chemistry, a bold flirtation, or a passionate new beginning. Say yes to excitement while staying true to your intentions.",
        "reversed": "Attraction fizzles or fear blocks a promising connection. Slow down, clarify desire, and reignite the flame with presence."
      },
      "career": {
        "upright": "A green light for a project, startup, or visionary idea. Take initiative and let enthusiasm lead the way.",
        "reversed": "Creative blocks or a stalled launch. Rework the pitch, gather resources, and wait for a more aligned window."
      },
      "finance": {
        "upright": "New income opportunities or a venture with growth potential. Invest in what energizes you, with prudent planning.",
        "reversed": "Risky impulses or delayed funding. Avoid rash spending; consolidate and prepare before committing."
      },
      "health": {
        "upright": "A burst of vitality—ideal for starting a fitness habit or energizing routine.",
        "reversed": "Fatigue or overexertion. Rest, hydrate, and rebuild gradually to prevent burnout."
      },
      "spiritual": {
        "upright": "A quickening of the spirit: follow the call, begin the practice, light the candle.",
        "reversed": "A creative dry spell invites inner tending. Simplify, reconnect to wonder, and let the spark return."
      }
    },
    "version": "1.0.0"
  },
  "RW-02-WANDS": {
    "name": "Two of Wands",
    "description": "On the castle battlements, a figure in rich robes holds a globe and looks out over land and sea. One wand is fixed to the wall, the other rests in the hand—stability in one realm, ambition reaching into another. The horizon stretches wide: planning, partnering, and measured boldness shape the next venture.",
    "keywords": {
      "upright": [
        "planning",
        "foresight",
        "strategy",
        "expansion",
        "choice",
        "vision"
      ],
      "reversed": [
        "playing it safe",
        "fear of the unknown",
        "indecision",
        "overplanning",
        "limited thinking",
        "delayed start"
      ]
    },
    "meanings": {
      "upright": "You’re surveying possibilities and mapping a path beyond familiar walls. Strategy, partnerships, and informed risk-taking set the stage for expansion.",
      "reversed": "Hesitation or narrow vision keeps you inside the comfort zone. Adjust the plan, widen the lens, or take a small step to break inertia."
    },
    "category_meanings": {
      "love": {
        "upright": "Conversations about the future, travel, or living arrangements. A partnership grows through shared vision.",
        "reversed": "Stagnation or long-distance logistics create doubt. Clarify expectations and timeline before proceeding."
      },
      "career": {
        "upright": "Strategic positioning, market research, and planning for growth. Align resources and prepare to launch.",
        "reversed": "Fear of exposure or unclear strategy. Reassess goals, gather data, and refine your approach."
      },
      "finance": {
        "upright": "Budgeting for expansion, education, or a calculated investment. Balance ambition with due diligence.",
        "reversed": "Reluctance to invest or poor planning. Avoid speculative moves until the groundwork is solid."
      },
      "health": {
        "upright": "Create a manageable plan for long-term wellbeing; set milestones and track progress.",
        "reversed": "Procrastination undermines health goals. Begin with one small, sustainable change."
      },
      "spiritual": {
        "upright": "Choosing a path of study or practice; your worldview broadens with intention.",
        "reversed": "Avoiding the call to grow. Explore safely but honestly where curiosity wants to lead."
      }
    },
    "version": "1.0.0"
  },
  "RW-03-WANDS": {
    "name": "Three of Wands",
    "description": "A traveler stands upon a cliff with three wands set firmly in the earth, gazing toward ships moving across a golden sea. The vision has left the drawing board; efforts are in motion. Horizons widen, allies align, and results begin to return from what you set in motion.",
    "keywords": {
      "upright": [
        "expansion",
        "progress",
        "foresight",
        "enterprise",
        "momentum",
        "exploration"
      ],
      "reversed": [
        "delays",
        "limited scope",
        "setbacks",
        "frustration",
        "need for adjustment",
        "missed opportunities"
      ]
    },
    "meanings": {
      "upright": "Momentum builds as plans take shape beyond your immediate shore. Collaboration and foresight bring steady progress and tangible returns.",
      "reversed": "Temporary delays or narrow vision slow growth. Recalibrate logistics, seek broader perspectives, and allow time for tides to turn."
    },
    "category_meanings": {
      "love": {
        "upright": "Shared plans flourish—travel, moving forward, or expanding your world together.",
        "reversed": "Long-distance strains or mismatched timing. Patience and honest coordination are needed."
      },
      "career": {
        "upright": "Expansion, new markets, or successful delegation. Your leadership scales the vision.",
        "reversed": "Shipping, scheduling, or teamwork issues. Tidy processes and renegotiate timelines."
      },
      "finance": {
        "upright": "Returns begin to appear; investments or side ventures show promise.",
        "reversed": "Payouts lag or profits are smaller than expected. Adjust strategy and reduce leakage."
      },
      "health": {
        "upright": "Steady improvement through consistent habits and support.",
        "reversed": "Minor setbacks. Keep perspective, refine routines, and persist."
      },
      "spiritual": {
        "upright": "A broadened outlook through travel, study, or new teachers. Integration follows exploration.",
        "reversed": "Insularity limits growth. Seek diverse voices and widen spiritual horizons."
      }
    },
    "version": "1.0.0"
  },
  "RW-04-WANDS": {
    "name": "Four of Wands",
    "description": "Four wands rise like posts for a festive garland; beyond them, figures wave bouquets in celebration near a welcoming castle. This is a threshold of joy—homecoming, reunion, and the sweet solidity of belonging. Milestones are honored, and community makes success sing.",
    "keywords": {
      "upright": [
        "celebration",
        "home",
        "stability",
        "milestone",
        "community",
        "joy",
        "foundation"
      ],
      "reversed": [
        "instability",
        "private celebration",
        "delayed milestone",
        "domestic tension",
        "disconnection"
      ]
    },
    "meanings": {
      "upright": "Harmony and achievement are recognized and shared. A foundation has been laid; pause to revel in the warmth of community and the security of home.",
      "reversed": "The joy is quieter or postponed—perhaps celebrated privately or overshadowed by minor tensions. Tend the roots to restore ease."
    },
    "category_meanings": {
      "love": {
        "upright": "Commitment, engagement, or a happy event. A relationship feels supported and secure.",
        "reversed": "Family dynamics or living arrangements strain the bond. Keep celebration intimate and set healthy boundaries."
      },
      "career": {
        "upright": "A project reaches a successful checkpoint; team morale and recognition are high.",
        "reversed": "Lack of acknowledgment or office politics dims the win. Celebrate within your trusted circle."
      },
      "finance": {
        "upright": "Financial stability and wise planning around home or property.",
        "reversed": "Home-related expenses or delays in moving/renovation. Budget carefully to reduce stress."
      },
      "health": {
        "upright": "Recovery supported by a peaceful environment and caring community.",
        "reversed": "Domestic stress affects wellbeing. Simplify your surroundings and reestablish routines."
      },
      "spiritual": {
        "upright": "Create sacred space, honor rites of passage, and practice gratitude.",
        "reversed": "Energy at home feels unsettled. Cleanse, reorganize, and invite harmony back in."
      }
    },
    "version": "1.0.0"
  },
  "RW-05-WANDS": {
    "name": "Five of Wands",
    "description": "Five youths clash playfully with their wands, a tangle of limbs and crossed sticks against a bright sky. It is the roar of competition and the friction of differing views—more sparring than war. Through this lively chaos, skills are tested and voices learn to find rhythm together.",
    "keywords": {
      "upright": [
        "competition",
        "conflict",
        "debate",
        "friction",
        "testing",
        "diverse opinions",
        "practice"
      ],
      "reversed": [
        "inner conflict",
        "avoidance",
        "resolution",
        "escalation averted",
        "cooperation",
        "realignment"
      ]
    },
    "meanings": {
      "upright": "Expect lively challenges and strong opinions. Healthy competition can sharpen your edge—if you keep it constructive and focused on learning.",
      "reversed": "Tension moves inward or begins to settle. Address core issues, clear the air, and channel energy into solutions rather than noise."
    },
    "category_meanings": {
      "love": {
        "upright": "Bickering or competing needs. Turn conflict into honest, fair dialogue.",
        "reversed": "Making peace after a rough patch—or suppressing what needs to be said. Choose clarity and kindness."
      },
      "career": {
        "upright": "A competitive field or brainstorming that borders on chaotic. Facilitate structure and roles.",
        "reversed": "Office drama cools or festers beneath the surface. Mediate openly to prevent flare-ups."
      },
      "finance": {
        "upright": "Competing expenses and priorities. Compare options and negotiate assertively.",
        "reversed": "Disputes over money resolve through compromise. Avoid zero-sum thinking."
      },
      "health": {
        "upright": "Stress and scattered energy. Exercise or sport can channel it productively.",
        "reversed": "Relief from agitation—focus on calming practices and regular rest."
      },
      "spiritual": {
        "upright": "A test of will or conflicting beliefs. Seek dialogue and broaden understanding.",
        "reversed": "Integration after inner struggle. Let humility guide reconciliation."
      }
    },
    "version": "1.0.0"
  },
  "RW-06-WANDS": {
    "name": "Six of Wands",
    "description": "A laurel-crowned rider advances on a white horse, his wand adorned with a wreath, as the crowd looks on. This is the parade of victory after trial—the moment when effort becomes visible and esteem is earned. Confidence and leadership shine, inviting others to believe as you do.",
    "keywords": {
      "upright": [
        "victory",
        "recognition",
        "success",
        "leadership",
        "confidence",
        "acclaim"
      ],
      "reversed": [
        "self-doubt",
        "delayed recognition",
        "pride before a fall",
        "fall from grace",
        "hollow victory",
        "overattention"
      ]
    },
    "meanings": {
      "upright": "Achievement is acknowledged publicly; you’ve carried the standard and won ground. Receive the praise, and use your platform to uplift others.",
      "reversed": "Validation is delayed or feels superficial. Guard against ego traps, steady your craft, and let substance anchor your shine."
    },
    "category_meanings": {
      "love": {
        "upright": "A relationship steps into the light—public support, pride in each other, shared wins.",
        "reversed": "Attention-seeking or comparison undermines intimacy. Seek genuine reassurance, not applause."
      },
      "career": {
        "upright": "Promotion, awards, or a successful launch. Lead with integrity and clarity.",
        "reversed": "Overlooked contributions or imposter syndrome. Document achievements and advocate fairly."
      },
      "finance": {
        "upright": "Bonuses, profitable outcomes, or a goal reached. Maintain smart stewardship.",
        "reversed": "Status spending or overconfidence. Keep budgets realistic and long-term."
      },
      "health": {
        "upright": "A breakthrough or milestone: treatment works, stamina returns.",
        "reversed": "Plateau or pressure to perform. Celebrate small wins and rest deliberately."
      },
      "spiritual": {
        "upright": "Recognize your progress; gratitude multiplies grace.",
        "reversed": "Practice humility. Let quiet devotion outlast public praise."
      }
    },
    "version": "1.0.0"
  },
  "RW-07-WANDS": {
    "name": "Seven of Wands",
    "description": "On a high ridge, a figure braces with a wand against six rising below, stance awkward, shoes mismatched—yet unshaken. This is the courage to hold your ground when challenged, to defend what’s been won, and to turn pressure into proof of conviction.",
    "keywords": {
      "upright": [
        "defense",
        "courage",
        "boundaries",
        "conviction",
        "perseverance",
        "standing your ground"
      ],
      "reversed": [
        "overwhelm",
        "defensiveness",
        "backing down",
        "compromise",
        "burnout",
        "giving up too soon"
      ]
    },
    "meanings": {
      "upright": "You’ve reached higher ground; now protect it with clarity and resilience. Say no when needed and act from values, not fear.",
      "reversed": "Fatigue or insecurity weakens resolve. Choose your battles, seek support, and realign effort with what truly matters."
    },
    "category_meanings": {
      "love": {
        "upright": "Healthy boundaries strengthen trust. Stand firm on non-negotiables with compassion.",
        "reversed": "Hyper-defensiveness blocks closeness—or you’re conceding too much. Rebalance give and take."
      },
      "career": {
        "upright": "Defend your idea, negotiate terms, or hold a market position. Preparation wins the day.",
        "reversed": "Spread too thin or resisting feedback. Consolidate and collaborate strategically."
      },
      "finance": {
        "upright": "Protect assets, dispute unfair charges, or hold to your budget.",
        "reversed": "Pressure from bills or legal issues. Seek advice and restructure obligations."
      },
      "health": {
        "upright": "Resilience and immune strength through consistent habits.",
        "reversed": "Exhaustion and stress. Rest, simplify, and ask for help."
      },
      "spiritual": {
        "upright": "Hold to your practice amid skepticism; conviction matures in challenge.",
        "reversed": "Rigidity stifles growth. Loosen your grip and listen inwardly."
      }
    },
    "version": "1.0.0"
  },
  "RW-08-WANDS": {
    "name": "Eight of Wands",
    "description": "Eight wands streak diagonally through a clear sky above a river and green fields—pure motion with nothing to obstruct it. News travels, plans accelerate, and events align swiftly. Momentum gathers; aim well and let the current carry you.",
    "keywords": {
      "upright": [
        "speed",
        "movement",
        "communication",
        "travel",
        "momentum",
        "alignment",
        "swift results"
      ],
      "reversed": [
        "delays",
        "miscommunication",
        "scattered focus",
        "canceled travel",
        "impatience",
        "mixed signals"
      ]
    },
    "meanings": {
      "upright": "Things move fast—messages, travel, and decisions flow in a flurry of progress. Stay responsive, prioritize, and ride the surge.",
      "reversed": "Slowdowns, crossed wires, or logistical snags. Pause to clarify, streamline, and reset timing."
    },
    "category_meanings": {
      "love": {
        "upright": "Quickening romance, flirty messages, or sudden clarity. Let excitement unfold naturally.",
        "reversed": "Text lag, misunderstandings, or rushing commitments. Communicate simply and honestly."
      },
      "career": {
        "upright": "Rapid launches, busy inboxes, swift approvals. Organize and delegate to keep pace.",
        "reversed": "Bottlenecks or errors from haste. Recheck details and adjust timelines."
      },
      "finance": {
        "upright": "Fast transactions or timely payments. Capitalize on brief windows.",
        "reversed": "Delays in payouts or transfers. Confirm terms and avoid impulse buys."
      },
      "health": {
        "upright": "Quick improvement or successful short-term protocols.",
        "reversed": "Overexertion or scattered routines. Slow down and recover properly."
      },
      "spiritual": {
        "upright": "Synchronicities and downloads arrive rapidly. Anchor insights with simple practices.",
        "reversed": "Integration lags behind inspiration. Ground before the next leap."
      }
    },
    "version": "1.0.0"
  },
  "RW-09-WANDS": {
    "name": "Nine of Wands",
    "description": "A weary sentinel, head bandaged, clutches a wand while eight stand behind like a palisade. The eyes are watchful but unbroken. This is the grit to endure the final stretch, to honor your scars as proof of strength, and to guard what matters without hardening the heart.",
    "keywords": {
      "upright": [
        "resilience",
        "persistence",
        "stamina",
        "boundaries",
        "vigilance",
        "last push"
      ],
      "reversed": [
        "burnout",
        "paranoia",
        "refusing help",
        "overprotection",
        "dropping the guard",
        "chronic fatigue"
      ]
    },
    "meanings": {
      "upright": "You’re close to the finish despite setbacks. Conserve energy, keep faith with your purpose, and pace the final push.",
      "reversed": "Walls are too high or strength is running low. Accept support, release hypervigilance, and prioritize recovery."
    },
    "category_meanings": {
      "love": {
        "upright": "A cautious heart heals while staying open. Protect your needs without closing the door.",
        "reversed": "Defenses choke intimacy—or you’re finally ready to let someone in. Communicate fears gently."
      },
      "career": {
        "upright": "Last hurdles before completion. Maintain boundaries and avoid scope creep.",
        "reversed": "Exhaustion or distrust of colleagues. Delegate and take restorative breaks."
      },
      "finance": {
        "upright": "Guard resources and stick to the plan; resilience pays off.",
        "reversed": "Survival mode narrows choices. Seek counsel and restructure obligations."
      },
      "health": {
        "upright": "Steady recovery with mindful pacing. Avoid overdoing it.",
        "reversed": "Chronic stress signals a need for real rest and support."
      },
      "spiritual": {
        "upright": "Persevere in your practice; strength is tempered through trial.",
        "reversed": "Fear-based rigidity. Invite softness and trust into your path."
      }
    },
    "version": "1.0.0"
  },
  "RW-10-WANDS": {
    "name": "Ten of Wands",
    "description": "Bent forward under a heavy bundle of ten wands, a figure trudges toward a town’s gate. The goal is near, but the load masks the path and strains the back. This is culmination through effort—and the wisdom to lighten what is no longer yours to carry.",
    "keywords": {
      "upright": [
        "burden",
        "responsibility",
        "overload",
        "duty",
        "hard work",
        "culmination",
        "commitment"
      ],
      "reversed": [
        "release",
        "delegation",
        "collapse from strain",
        "misplaced priorities",
        "burnout",
        "lightening the load"
      ]
    },
    "meanings": {
      "upright": "You shoulder many obligations as you approach completion. Simplify where possible and keep your eyes on the destination.",
      "reversed": "The weight is unsustainable. Let go, delegate, or reorder priorities before fatigue turns to fallout."
    },
    "category_meanings": {
      "love": {
        "upright": "Responsibilities press on romance; one partner may carry more. Share the load and schedule joy.",
        "reversed": "Put down old baggage and renegotiate roles. Compassionate boundaries revive connection."
      },
      "career": {
        "upright": "Overwork and task saturation. Consolidate, prioritize, and finish smart.",
        "reversed": "Delegate effectively or decline extra duties. Sustainability beats martyrdom."
      },
      "finance": {
        "upright": "Debt or financial pressure feels heavy. Create a structured, realistic payoff plan.",
        "reversed": "Simplify accounts, reduce commitments, and seek relief options."
      },
      "health": {
        "upright": "Physical strain, tension in back or shoulders. Rest and ergonomic support are essential.",
        "reversed": "Recovery begins with shedding stressors and honoring limits."
      },
      "spiritual": {
        "upright": "Karmic lessons through service and endurance. Meaning grows when duty is chosen with heart.",
        "reversed": "A ritual of release: lay down what isn’t yours and reclaim your fire."
      }
    },
    "version": "1.0.0"
  },
  "RW-PAGE-WANDS": {
    "name": "Page of Wands",
    "description": "A court card of the Minor Arcana in the suit of Wands, the Page of Wands embodies first sparks and eager beginnings. In the Rider–Waite image, a bright-clad youth stands in a sun-baked desert dotted with distant pyramids, turning his face toward a budding staff as if hearing it speak. Salamander motifs dance across his tunic and a feather rises from his cap, hints of fire and aspiration. The barren sand contrasts with the green shoots on the wand, a promise that life can spring even from the most unlikely ground. This Page is the herald of new ideas and adventurous messages, the moment when curiosity ignites and the road ahead shimmers with possibility.",
    "keywords": {
      "upright": [
        "enthusiasm",
        "discovery",
        "messages",
        "creative spark",
        "curiosity",
        "new paths"
      ],
      "reversed": [
        "restlessness",
        "false starts",
        "immaturity",
        "self-doubt",
        "delays",
        "scattered focus"
      ]
    },
    "meanings": {
      "upright": "Fresh inspiration arrives, urging you to explore, learn, and try. This is the bright call of curiosity and creative potential, inviting a courageous first step.",
      "reversed": "Energy is blocked or scattered; you may be second-guessing yourself or jumping from idea to idea. Slow down, ground your fire, and refine the message you want to carry."
    },
    "category_meanings": {
      "love": {
        "upright": "Flirtatious beginnings, playful texts, and a spark that feels promising. Be open, honest, and let the connection grow at its natural pace.",
        "reversed": "Mixed signals or immature behavior may disrupt romance. Avoid games; clarify intentions before investing your heart."
      },
      "career": {
        "upright": "A new project, study path, or role lights you up. Say yes to internships, training, or initiatives that grow your skills.",
        "reversed": "Lack of direction or impulsive pivots stall progress. Create a simple plan and commit to one step at a time."
      },
      "finance": {
        "upright": "Small opportunities for income or learning about money appear. Start modestly and build confidence through informed action.",
        "reversed": "Inexperience may lead to impulsive purchases or risky dabbling. Educate yourself before committing resources."
      },
      "health": {
        "upright": "A new routine, class, or practice rekindles vitality. Keep it fun and sustainable to maintain momentum.",
        "reversed": "Start–stop patterns or impatience may undermine progress. Set realistic goals and listen to your body."
      },
      "spiritual": {
        "upright": "Signs, synchronicities, and messages spark a fresh path of growth. Follow your curiosity; journal what arrives.",
        "reversed": "Doubt or distraction clouds the inner voice. Simplify rituals and return to the beginner’s mind."
      }
    },
    "version": "1.0.0"
  },
  "RW-KNIGHT-WANDS": {
    "name": "Knight of Wands",
    "description": "A court card of the Minor Arcana in the suit of Wands, the Knight of Wands charges forward like living fire. In the Rider–Waite scene, a knight in armor, his tunic patterned with salamanders, lifts a sprouting wand as his horse rears against a desert horizon and distant pyramids. Plumes stream from his helmet, and dust rises in his wake; he is momentum personified, brave, charismatic, and hungry for new territory. This card is the thunderclap after the spark — the urge to move, to conquer hesitation, and to bring passion from thought into the open world.",
    "keywords": {
      "upright": [
        "action",
        "courage",
        "adventure",
        "momentum",
        "charisma",
        "travel",
        "initiative"
      ],
      "reversed": [
        "impulsiveness",
        "recklessness",
        "delays",
        "anger",
        "burnout",
        "inconsistency"
      ]
    },
    "meanings": {
      "upright": "Bold movement and confident initiative propel you forward. Seize the moment, but channel your speed with purpose.",
      "reversed": "Rash choices or scattered efforts waste energy. Slow the pace, temper the fire, and align action with a clear plan."
    },
    "category_meanings": {
      "love": {
        "upright": "Passionate chemistry and whirlwind romance. Enjoy the heat while setting healthy boundaries and intentions.",
        "reversed": "Hot-and-cold behavior or a ‘player’ attitude sparks confusion. Ground the connection; demand consistency."
      },
      "career": {
        "upright": "Launches, pitches, travel, or a daring pivot bring progress. Lead with confidence and keep logistics tight.",
        "reversed": "Half-baked plans and impatience lead to misfires. Reassess timelines, reduce distractions, and finish what you start."
      },
      "finance": {
        "upright": "Money moves quickly — opportunities favor decisive yet calculated risks. Keep reserves for rapid changes.",
        "reversed": "Speculative or ego-driven spending threatens stability. Avoid snap purchases and high-volatility bets."
      },
      "health": {
        "upright": "High energy supports fitness gains and active recovery. Warm up properly and respect limits to avoid strains.",
        "reversed": "Overexertion, inflammation, or minor accidents are more likely. Rest and structured training are essential."
      },
      "spiritual": {
        "upright": "A quest begins — retreats, pilgrimages, or brave practice changes call you forward. Act on your inspiration.",
        "reversed": "Chasing thrills replaces depth. Return to intention and integrate lessons before the next leap."
      }
    },
    "version": "1.0.0"
  },
  "RW-QUEEN-WANDS": {
    "name": "Queen of Wands",
    "description": "A court card of the Minor Arcana in the suit of Wands, the Queen of Wands radiates confident warmth and sovereign creativity. In the Rider–Waite image, she sits upon a throne carved with lions, holding a flowering wand in one hand and a sunflower in the other, emblem of life and solar joy. At her feet rests a black cat, familiar and guardian, hinting at intuition beneath her bright presence. Sunflowers and golden tones surround her, a testament to courage, generosity, and the magic of a heart set ablaze with purpose.",
    "keywords": {
      "upright": [
        "confidence",
        "magnetism",
        "independence",
        "vitality",
        "generosity",
        "courage",
        "leadership"
      ],
      "reversed": [
        "jealousy",
        "insecurity",
        "drama",
        "overextension",
        "introversion",
        "controlling tendencies"
      ]
    },
    "meanings": {
      "upright": "You shine with warm authority and creative vigor. Lead from the heart, uplift others, and act with charismatic integrity.",
      "reversed": "Your fire may be smothered by doubt or scattered by drama. Reclaim boundaries, replenish energy, and trust your inner sun."
    },
    "category_meanings": {
      "love": {
        "upright": "A vibrant, loyal, and supportive connection thrives. Express passion openly and honor mutual independence.",
        "reversed": "Possessiveness or attention-seeking sparks conflict. Temper pride, communicate needs, and reduce reactive behavior."
      },
      "career": {
        "upright": "You inspire teams and attract opportunities through presence and courage. Network boldly and champion creative solutions.",
        "reversed": "Office politics or overcommitting drains momentum. Delegate wisely and step back from unnecessary battles."
      },
      "finance": {
        "upright": "Confident budgeting with room for generosity. Investments in visibility, home, or creative ventures can flourish.",
        "reversed": "Spending to impress or soothe anxiety backfires. Simplify plans and avoid performative purchases."
      },
      "health": {
        "upright": "Strong vitality and steady motivation. Activities that blend joy and movement keep your flame bright.",
        "reversed": "Burnout or hormonal stress calls for rest and warmth. Protect your energy and reduce overbooking."
      },
      "spiritual": {
        "upright": "Your intuition purrs beneath radiant self-belief. Rituals that celebrate creativity deepen your magic.",
        "reversed": "Shadow themes of envy or comparison arise. Practice self-acceptance and re-center on authentic desire."
      }
    },
    "version": "1.0.0"
  },
  "RW-KING-WANDS": {
    "name": "King of Wands",
    "description": "A court card of the Minor Arcana in the suit of Wands, the King of Wands is visionary fire mastered. In the Rider–Waite portrayal, he sits upright on a throne adorned with lions and salamanders, his cloak patterned with salamanders biting their tails — the fire that sustains itself. He holds a flowering staff like a scepter, and a small lizard crawls nearby, echoing resilience and transformation. His gaze is steady and forward, the look of one who sets direction and commands momentum without losing heart.",
    "keywords": {
      "upright": [
        "leadership",
        "vision",
        "entrepreneurship",
        "influence",
        "determination",
        "integrity",
        "bold strategy"
      ],
      "reversed": [
        "domineering",
        "impulsivity",
        "temper",
        "intolerance",
        "rigidity",
        "egocentrism",
        "short fuse"
      ]
    },
    "meanings": {
      "upright": "You are called to lead with courage, clarity, and big-picture vision. Take command, inspire action, and stand by your principles.",
      "reversed": "Force without empathy undermines authority. Replace knee-jerk reactions with strategy, and channel passion into constructive leadership."
    },
    "category_meanings": {
      "love": {
        "upright": "A passionate, protective, and decisive partner sets a steady course. Be clear about goals and nurture mutual respect.",
        "reversed": "Control, impatience, or pride strain connection. Share power, cool tempers, and practice active listening."
      },
      "career": {
        "upright": "Entrepreneurial moves and visionary strategy pay off. Rally others, delegate well, and scale with purpose.",
        "reversed": "Micromanagement, snap judgments, or ego clashes stall progress. Build consensus and refine the long game."
      },
      "finance": {
        "upright": "Long-term growth through strong leadership and calculated risks. Align investments with values and strategy.",
        "reversed": "Rigid stances or ego-driven bets create volatility. Seek counsel and avoid grandstanding with money."
      },
      "health": {
        "upright": "Discipline and willpower support robust stamina. A structured plan keeps energy high and focused.",
        "reversed": "Overwork or anger-related tension affects wellbeing. Incorporate stress relief and avoid pushing past limits."
      },
      "spiritual": {
        "upright": "Mastery of will serves a larger purpose. Lead by example and kindle courage in your community.",
        "reversed": "Dogmatism dims the flame. Reopen to feedback, humility, and the wisdom of shared fire."
      }
    },
    "version": "1.0.0"
  },
  "RW-ACE-CUPS": {
    "name": "Ace of Cups",
    "description": "The Ace of Cups opens the Suit of Cups in the Minor Arcana, a holy vessel of the heart overflowing with possibility. In the Rider–Waite image, a divine hand emerges from a cloud, offering a golden chalice that spills five shimmering streams into a tranquil pool dotted with lotuses. A white dove descends toward the cup with a wafer of blessing, suggesting grace, peace, and a direct infusion of spirit into feeling — the first swell of love, intuition, and creative life.",
    "keywords": {
      "upright": [
        "new love",
        "emotional opening",
        "compassion",
        "intuition",
        "creativity",
        "fertility",
        "grace",
        "spiritual communion"
      ],
      "reversed": [
        "blocked emotions",
        "emptiness",
        "emotional fatigue",
        "creative drought",
        "self-love needed",
        "suppressed feelings"
      ]
    },
    "meanings": {
      "upright": "A fresh wave of emotion, connection, and inspiration arrives, inviting your heart to open. Let feeling flow; there is love and creative grace to receive.",
      "reversed": "The heart’s cup feels closed or depleted, asking for gentleness and replenishment. Attend to self-love and allow release so feeling can flow again."
    },
    "category_meanings": {
      "love": {
        "upright": "New romance or a heartfelt renewal breathes tenderness and trust into connection.",
        "reversed": "Guardedness or old wounds block intimacy; heal and soften before proceeding."
      },
      "career": {
        "upright": "A creatively nourishing project or team environment emerges, boosting morale and inspiration.",
        "reversed": "Emotional burnout or misalignment at work; step back to reconnect with purpose."
      },
      "finance": {
        "upright": "Kindness, gifts, or supportive opportunities appear; invest where your heart is engaged.",
        "reversed": "Mood-based spending or uncertain priorities; ground decisions and set gentle limits."
      },
      "health": {
        "upright": "Renewed vitality and emotional wellbeing; hydration, rest, and care bring balance.",
        "reversed": "Low mood or depletion signals the need for nurturing routines and compassionate support."
      },
      "spiritual": {
        "upright": "A heart-opening blessing and direct experience of the sacred; trust the flow of grace.",
        "reversed": "Feeling disconnected; restore ritual, quiet, and self-compassion to refill your cup."
      }
    },
    "version": "1.0.0"
  },
  "RW-02-CUPS": {
    "name": "Two of Cups",
    "description": "The Two of Cups in the Minor Arcana celebrates meeting in the middle — the moment two hearts recognize each other. In the Rider–Waite scene, a man and woman exchange cups as a caduceus rises between them, crowned by a red lion, symbolizing healed exchange, passion, and sacred accord. The air shimmers with the promise of reciprocity and the harmony that grows when trust is offered and received.",
    "keywords": {
      "upright": [
        "partnership",
        "mutual attraction",
        "harmony",
        "reciprocity",
        "trust",
        "healing bond",
        "union"
      ],
      "reversed": [
        "disharmony",
        "imbalance",
        "codependency",
        "misunderstanding",
        "break in trust",
        "one-sidedness"
      ]
    },
    "meanings": {
      "upright": "A balanced partnership forms or deepens, marked by mutual respect and shared feeling. This is the medicine of meeting halfway and choosing connection.",
      "reversed": "A bond is out of balance or strained by miscommunication or unequal effort. Recalibrate boundaries and restore honest dialogue."
    },
    "category_meanings": {
      "love": {
        "upright": "Soulful chemistry and commitment grow through openhearted exchange.",
        "reversed": "Mixed signals or unequal investment; clarify needs and restore equilibrium."
      },
      "career": {
        "upright": "A fair deal, mentorship, or collaboration where both parties benefit.",
        "reversed": "Partnership tensions or incompatible styles; revisit terms and roles."
      },
      "finance": {
        "upright": "Equitable agreements and shared budgeting strengthen security.",
        "reversed": "Uneven contributions or risky lending to loved ones; set clear terms."
      },
      "health": {
        "upright": "Supportive care and accountability partners aid recovery and balance.",
        "reversed": "Stress from relational conflict impacts wellbeing; seek mediation and self-care."
      },
      "spiritual": {
        "upright": "Inner masculine and feminine energies harmonize; relationships mirror healing.",
        "reversed": "An inner split seeks reconciliation; cultivate self-trust and integration."
      }
    },
    "version": "1.0.0"
  },
  "RW-03-CUPS": {
    "name": "Three of Cups",
    "description": "A Minor Arcana hymn to friendship and shared joy, the Three of Cups shows three women dancing in a circle, their goblets raised. In the Rider–Waite image, ripe fruit and gourds lie at their feet, a harvest of abundance that community brings. Laughter, music, and celebration braid together, reminding us that joy multiplies when it’s poured for others.",
    "keywords": {
      "upright": [
        "celebration",
        "friendship",
        "community",
        "reunion",
        "joy",
        "support network",
        "festivity"
      ],
      "reversed": [
        "overindulgence",
        "gossip",
        "exclusion",
        "three’s a crowd",
        "canceled plans",
        "isolation"
      ]
    },
    "meanings": {
      "upright": "Communal happiness and shared success arrive; gather, toast, and give thanks. Let connection be the cup that refills you.",
      "reversed": "Too much partying or social friction drains energy. Choose authentic company and healthy boundaries."
    },
    "category_meanings": {
      "love": {
        "upright": "Happy milestones, dates with friends, or joyful gatherings strengthen bonds.",
        "reversed": "Third-party complications or meddling friends; protect the intimacy of the relationship."
      },
      "career": {
        "upright": "Team wins and enthusiastic networking; collaboration bears fruit.",
        "reversed": "Cliques or unhelpful chatter; refocus on shared goals and professionalism."
      },
      "finance": {
        "upright": "Bonuses, shared resources, or celebrating financial progress.",
        "reversed": "Overspending on nights out, events, or keeping up appearances."
      },
      "health": {
        "upright": "Recovery supported by community, movement, and joyful routines.",
        "reversed": "Overindulgence or late nights sap vitality; balance fun with rest."
      },
      "spiritual": {
        "upright": "A circle, coven, or group practice uplifts your spirit.",
        "reversed": "Superficial connections; seek soulful community and purpose-driven ritual."
      }
    },
    "version": "1.0.0"
  },
  "RW-04-CUPS": {
    "name": "Four of Cups",
    "description": "The Four of Cups, a Minor Arcana card of the Suit of Cups, sits in contemplative stillness. In the Rider–Waite image, a figure under a tree stares at three cups while a fourth is quietly offered by a hand from a cloud, unnoticed. The scene hums with boredom and introspection, the pause in which desire questions itself and a subtle gift waits to be seen.",
    "keywords": {
      "upright": [
        "contemplation",
        "apathy",
        "reevaluation",
        "withdrawal",
        "discontent",
        "boredom"
      ],
      "reversed": [
        "renewed interest",
        "openness",
        "reengagement",
        "acceptance",
        "gratitude",
        "fresh start"
      ]
    },
    "meanings": {
      "upright": "You may be disengaged, focused on what isn’t satisfying and missing a quiet offering. Step inward to clarify desire, then look again with fresh eyes.",
      "reversed": "A stir of interest returns and you’re ready to say yes. New options appear as you shift into gratitude and presence."
    },
    "category_meanings": {
      "love": {
        "upright": "Emotional withdrawal or boredom; honor your needs and communicate.",
        "reversed": "A renewed willingness to connect or explore new dating possibilities."
      },
      "career": {
        "upright": "Stagnation or lack of motivation; a promising project may be overlooked.",
        "reversed": "Energy returns; seize the offer that aligns with your values."
      },
      "finance": {
        "upright": "Cautious or indifferent to new opportunities; review options thoughtfully.",
        "reversed": "A timely chance becomes visible; act with measured optimism."
      },
      "health": {
        "upright": "Lethargy or emotional flatness; gentle routines and nature time help.",
        "reversed": "Momentum builds; small, consistent changes lift mood and energy."
      },
      "spiritual": {
        "upright": "A quiet period of reflection; the next step is subtle and inward.",
        "reversed": "Fresh inspiration and a nudge from spirit rekindle devotion."
      }
    },
    "version": "1.0.0"
  },
  "RW-05-CUPS": {
    "name": "Five of Cups",
    "description": "The Five of Cups, a Minor Arcana lesson in grief and perspective, shows a cloaked figure fixated on three spilled cups. In the Rider–Waite landscape, two cups still stand behind them, and a bridge leads across a river to a distant dwelling — loss and possibility coexisting. The card pauses at the threshold where mourning can soften into meaning.",
    "keywords": {
      "upright": [
        "grief",
        "loss",
        "regret",
        "disappointment",
        "mourning",
        "focusing on the negative"
      ],
      "reversed": [
        "acceptance",
        "forgiveness",
        "moving on",
        "perspective shift",
        "emotional recovery"
      ]
    },
    "meanings": {
      "upright": "A sorrow or setback weighs heavily, narrowing your gaze to what’s gone. Yet something remains; turn gently to what still stands.",
      "reversed": "Grief loosens its hold, allowing forgiveness and forward motion. What was lost becomes a teacher rather than a jailer."
    },
    "category_meanings": {
      "love": {
        "upright": "Heartbreak or disappointment lingers; honor the feelings without dwelling forever.",
        "reversed": "Reconciliation or closure becomes possible as perspective softens."
      },
      "career": {
        "upright": "A project fails or an opportunity slips; learn, regroup, and cross the bridge to the next stage.",
        "reversed": "Recovery after a misstep; constructive feedback guides improvement."
      },
      "finance": {
        "upright": "Losses or buyer’s remorse; avoid doubling down from despair.",
        "reversed": "Stabilization and modest recovery through practical adjustments."
      },
      "health": {
        "upright": "Low mood affects vitality; grief work and support are medicine.",
        "reversed": "Therapy, rest, and compassion ease symptoms and renew strength."
      },
      "spiritual": {
        "upright": "A dark night of the soul invites honest feeling and surrender.",
        "reversed": "Light returns as meaning is found; gratitude coexists with sorrow."
      }
    },
    "version": "1.0.0"
  },
  "RW-06-CUPS": {
    "name": "Six of Cups",
    "description": "The Six of Cups, a Minor Arcana ode to innocence and memory, shows children sharing flowers in cups within a quiet courtyard. In the Rider–Waite scene, a child offers a cup filled with white blossoms to another, while the old house and a distant figure suggest time’s gentle passage. Kindness, nostalgia, and the sweetness of simple moments open like a well-kept garden.",
    "keywords": {
      "upright": [
        "nostalgia",
        "kindness",
        "innocence",
        "reunion",
        "simple joy",
        "generosity",
        "childhood"
      ],
      "reversed": [
        "living in the past",
        "idealization",
        "naivety",
        "letting go",
        "independence",
        "growing up"
      ]
    },
    "meanings": {
      "upright": "A tender return to simpler joys, past connections, or healing memories. Acts of kindness and familiarity nourish the heart.",
      "reversed": "The past may be holding you too tightly or tinted by idealization. Bless what was and make room for who you are becoming."
    },
    "category_meanings": {
      "love": {
        "upright": "Sweet reconnection or a relationship marked by gentleness and play.",
        "reversed": "Stuck on an ex or childish dynamics; mature the bond or move on."
      },
      "career": {
        "upright": "Mentorship, a supportive workplace, or returning to a beloved skill.",
        "reversed": "Outdated methods or resistance to change; update your toolkit."
      },
      "finance": {
        "upright": "Modest stability, gifts, or help from family roots.",
        "reversed": "Clinging to old valuations or budgets; modernize and plan ahead."
      },
      "health": {
        "upright": "Gentle routines and play support healing; tend the inner child.",
        "reversed": "Past patterns affect health; seek to unwind inherited habits."
      },
      "spiritual": {
        "upright": "Ancestral blessings and childlike wonder reopen the heart.",
        "reversed": "Do inner-child work to reconcile memory with present truth."
      }
    },
    "version": "1.0.0"
  },
  "RW-07-CUPS": {
    "name": "Seven of Cups",
    "description": "The Seven of Cups in the Minor Arcana unveils a sky of possibilities as a figure gazes at seven cups floating in cloud. In the Rider–Waite image, each cup holds a tempting vision — jewels, a laurel wreath, a castle, a dragon, a snake, a veiled figure, a beautiful face — fantasies and fears mingled. The moment is rich with imagination and risk: choose with wisdom, or be chosen by illusion.",
    "keywords": {
      "upright": [
        "choices",
        "imagination",
        "fantasy",
        "wishful thinking",
        "temptation",
        "options",
        "vision"
      ],
      "reversed": [
        "clarity",
        "realism",
        "prioritization",
        "decision",
        "focus",
        "grounded action"
      ]
    },
    "meanings": {
      "upright": "So many paths beckon that focus blurs; not all glitter is gold. Discern values, test assumptions, and pick one true cup.",
      "reversed": "Fog lifts and priorities crystallize. Commit to a clear choice and channel energy into tangible steps."
    },
    "category_meanings": {
      "love": {
        "upright": "Many suitors or daydreams; avoid projecting fantasies onto partners.",
        "reversed": "Choose the relationship that is real and reciprocal; set firm boundaries."
      },
      "career": {
        "upright": "Brainstorming abounds, but scope creep threatens progress; define criteria.",
        "reversed": "Streamline to an achievable plan or MVP and execute."
      },
      "finance": {
        "upright": "Speculative schemes tempt; verify before investing.",
        "reversed": "A sober budget and simple strategy restore stability."
      },
      "health": {
        "upright": "Overwhelm about treatments or routines; seek trusted guidance.",
        "reversed": "Select one approach and stick with it to see results."
      },
      "spiritual": {
        "upright": "Psychic and imaginative influx; ground visions in practice.",
        "reversed": "Discernment strengthens; cultivate a focused, embodied path."
      }
    },
    "version": "1.0.0"
  },
  "RW-08-CUPS": {
    "name": "Eight of Cups",
    "description": "The Eight of Cups, a Minor Arcana pilgrimage, shows a traveler leaving behind eight neatly stacked cups beneath a moonlit sky. In the Rider–Waite image, staff in hand, they turn toward mountains and the unknown, accepting that what once satisfied no longer does. It is the quiet courage to depart in search of deeper meaning.",
    "keywords": {
      "upright": [
        "walking away",
        "seeking truth",
        "letting go",
        "transition",
        "emotional detachment",
        "soul journey"
      ],
      "reversed": [
        "fear of change",
        "aimless drifting",
        "avoidance",
        "stagnation",
        "returning to the past"
      ]
    },
    "meanings": {
      "upright": "You are called to leave a hollow comfort for a more authentic path. Trust the pull toward what matters more than what is familiar.",
      "reversed": "Staying put out of fear or habit delays growth, or you may circle back to finish unfinished business. Name what you seek and take one honest step."
    },
    "category_meanings": {
      "love": {
        "upright": "Departing an unfulfilling bond or taking space to reevaluate needs.",
        "reversed": "Staying for the wrong reasons; confront avoidance and speak your truth."
      },
      "career": {
        "upright": "A purposeful pivot, sabbatical, or resignation to pursue meaning.",
        "reversed": "Golden handcuffs or drifting between jobs; clarify direction."
      },
      "finance": {
        "upright": "Letting go of sunk costs and redirecting resources wisely.",
        "reversed": "Clinging to poor investments; make a clean, strategic exit."
      },
      "health": {
        "upright": "Stepping away from draining habits; retreat supports healing.",
        "reversed": "Avoiding root causes; seek guidance and commit to change."
      },
      "spiritual": {
        "upright": "A quest for deeper truth; solitude and pilgrimage call.",
        "reversed": "Resisting the call; create a small daily practice to begin."
      }
    },
    "version": "1.0.0"
  },
  "RW-09-CUPS": {
    "name": "Nine of Cups",
    "description": "The Nine of Cups, a Minor Arcana emblem of contentment, shows a satisfied figure seated before a graceful arc of nine cups. In the Rider–Waite image, arms crossed and posture proud, they bask in the glow of wishes fulfilled and pleasures earned. The air is ripe with gratitude, inviting you to savor the feast you set for yourself.",
    "keywords": {
      "upright": [
        "satisfaction",
        "wish fulfillment",
        "gratitude",
        "comfort",
        "pleasure",
        "achievement"
      ],
      "reversed": [
        "smugness",
        "overindulgence",
        "hollow victory",
        "complacency",
        "dissatisfaction"
      ]
    },
    "meanings": {
      "upright": "A heartfelt wish comes true; enjoy the sweetness fully and gratefully. Pleasure is a portal to deeper appreciation.",
      "reversed": "Surface pleasures fail to satisfy or excess dulls joy. Seek authenticity and remember what truly nourishes."
    },
    "category_meanings": {
      "love": {
        "upright": "Warmth, sensuality, and mutual enjoyment flourish.",
        "reversed": "Self-centeredness or taking love for granted; practice appreciation."
      },
      "career": {
        "upright": "Recognition and a comfortable rhythm; celebrate your craft.",
        "reversed": "Complacency or vanity; set fresh goals and stay humble."
      },
      "finance": {
        "upright": "Comfortable resources and small luxuries are within reach.",
        "reversed": "Overspending on treats; align purchases with true values."
      },
      "health": {
        "upright": "Overall wellbeing improves; balanced pleasures support vitality.",
        "reversed": "Excess food, drink, or leisure affects health; recalibrate."
      },
      "spiritual": {
        "upright": "Gratitude practice deepens contentment and presence.",
        "reversed": "Spiritual materialism; return to sincerity and service."
      }
    },
    "version": "1.0.0"
  },
  "RW-10-CUPS": {
    "name": "Ten of Cups",
    "description": "The Ten of Cups crowns the Suit of Cups in the Minor Arcana with a vision of lasting harmony. In the Rider–Waite scene, a rainbow of ten cups arches above a couple with arms raised as children dance nearby, a home and river completing the pastoral peace. This is emotional fulfillment that extends outward — love woven into family, community, and place.",
    "keywords": {
      "upright": [
        "harmony",
        "family",
        "happiness",
        "peace",
        "lasting love",
        "alignment",
        "blessing"
      ],
      "reversed": [
        "domestic discord",
        "misaligned values",
        "broken peace",
        "estrangement",
        "unrealistic ideal"
      ]
    },
    "meanings": {
      "upright": "A season of deep contentment and belonging arrives, blessing home and relationships. Values align, and love ripples outward.",
      "reversed": "Cracks in the ideal appear or values clash under the roof. Address expectations honestly and rebuild shared harmony."
    },
    "category_meanings": {
      "love": {
        "upright": "Commitment, family milestones, and a secure, tender bond.",
        "reversed": "Tension at home or competing priorities; realign on what truly matters."
      },
      "career": {
        "upright": "Supportive culture and work-life harmony; purpose and people fit together.",
        "reversed": "Toxic dynamics or imbalance drains family life; set boundaries or seek better alignment."
      },
      "finance": {
        "upright": "Stable household finances and shared goals create ease.",
        "reversed": "Money disputes or unequal expectations; craft a compassionate plan."
      },
      "health": {
        "upright": "A peaceful, supportive environment strengthens wellbeing.",
        "reversed": "Family stress impacts health; cultivate calm and mutual care."
      },
      "spiritual": {
        "upright": "A sense of belonging to something larger — community, lineage, or love itself.",
        "reversed": "Reevaluate inherited ideals; define your own vision of fulfillment."
      }
    },
    "version": "1.0.0"
  },
  "RW-PAGE-CUPS": {
    "name": "Page of Cups",
    "description": "A Court card of the Minor Arcana, the Page of Cups embodies the first stirring of feelings within the suit of water. In the Rider–Waite image, a youthful figure stands on the shoreline in a patterned tunic and soft, beret-like cap, surprised and delighted as a fish peeks from the golden cup he raises. Gentle waves roll behind him, carrying whispers of dreams and synchronicities. This is the spark of emotion and imagination, the moment when intuition speaks in playful, unexpected ways and the heart learns a new language.",
    "keywords": {
      "upright": [
        "intuitive message",
        "creative beginnings",
        "emotional openness",
        "curiosity",
        "sensitivity",
        "synchronicity",
        "playfulness"
      ],
      "reversed": [
        "emotional immaturity",
        "insecurity",
        "blocked intuition",
        "oversensitivity",
        "escapism",
        "creative block",
        "naivety"
      ]
    },
    "meanings": {
      "upright": "Fresh emotional energy, messages of the heart, and creative nudges arise. Be receptive to signs, dreams, and gentle invitations that awaken wonder. Approach life with curiosity and a tender, imaginative spirit.",
      "reversed": "Feelings may be raw or misdirected, and intuition hard to trust. Immaturity, insecurity, or avoidance can muddle messages. Ground yourself, set gentle boundaries, and practice honest emotional expression."
    },
    "category_meanings": {
      "love": {
        "upright": "Sweet beginnings, crushes, and heartfelt gestures. Vulnerability and sincere communication open a tender path forward.",
        "reversed": "Immature exchanges, mixed signals, or fantasy replacing real connection. Slow down, clarify intentions, and protect your heart."
      },
      "career": {
        "upright": "A creative offer, study opportunity, or project that invites imagination. Be teachable and share your ideas with openness.",
        "reversed": "Unclear expectations, procrastination, or fragile confidence at work. Seek mentorship, refine skills, and set realistic goals."
      },
      "finance": {
        "upright": "Small but positive news about money or a new income idea. Nurture it patiently and learn as you go.",
        "reversed": "Impulsive purchases or wishful budgeting. Create a simple plan and avoid emotional spending.",
        "health": {
          "upright": "Gentle self-care and mind–body awareness support healing. Listen to dreams and your body’s subtle cues.",
          "reversed": "Moodiness or avoidance of health matters. Name your feelings, seek support, and take one small practical step."
        },
        "spiritual": {
          "upright": "Heightened intuition, meaningful coincidences, and vivid dreams. Begin a practice that honors your inner child and creativity.",
          "reversed": "Confusion or self-doubt clouds guidance. Simplify your practice, journal your feelings, and rebuild trust in your inner voice."
        }
      },
      "version": "1.0.0"
    },
    "RW-KNIGHT-CUPS": {
      "name": "Knight of Cups",
      "description": "A Court card of the Minor Arcana, the Knight of Cups rides forth as the poet of the suit of water. In the Rider–Waite scene, an armored knight on a calm, white horse advances with measured grace, bearing a single cup like a sacred offering. Winged motifs at his helmet and boots hint at elevated vision, while a winding stream and gentle landscape suggest feelings in motion. He is a messenger of romance, inspiration, and the quest to follow the heart with honor.",
      "keywords": {
        "upright": [
          "romance",
          "invitations",
          "proposal",
          "idealism",
          "diplomacy",
          "following the heart",
          "inspiration"
        ],
        "reversed": [
          "moodiness",
          "unrealistic expectations",
          "jealousy",
          "disappointment",
          "overpromising",
          "escapism",
          "procrastination"
        ]
      },
      "meanings": {
        "upright": "An offer or opportunity moves toward you with graceful sincerity. This is the call to pursue beauty, empathy, and authentic feeling. Lead with compassion and let inspiration guide your steps.",
        "reversed": "Charm without follow-through, shifting moods, or dreamy avoidance may stall progress. Ground your ideals, clarify intentions, and take consistent, tangible action."
      },
      "category_meanings": {
        "love": {
          "upright": "Romantic gestures, heartfelt conversations, and meaningful dates. A proposal or deepening of emotional commitment may be near.",
          "reversed": "Hot-and-cold behavior, mixed promises, or pedestal fantasies. Seek clarity, consistency, and mutual sincerity."
        },
        "career": {
          "upright": "A creative pitch, collaborative offer, or role requiring diplomacy and vision. Advocate for compassionate leadership.",
          "reversed": "Drifting through tasks, avoiding hard details, or selling a dream without a plan. Anchor your ideas in timelines and accountability."
        },
        "finance": {
          "upright": "Opportunities tied to art, hospitality, or counseling may arise. Lead with integrity and long-term values.",
          "reversed": "Spending to soothe feelings or investing in fantasies. Verify claims, read the fine print, and wait if emotions run high."
        },
        "health": {
          "upright": "Gentle movement, hydration, and practices that soothe the nervous system. Let kindness be your regimen.",
          "reversed": "Inconsistent routines or mood-driven health choices. Create a supportive schedule and ask for encouraging accountability."
        },
        "spiritual": {
          "upright": "A soulful quest awakens—follow beauty, poetry, and symbolic dreams. Devotional practices deepen your sensitivity.",
          "reversed": "Spiritual bypassing or chasing aesthetic over substance. Return to honest reflection and embodied compassion."
        }
      },
      "version": "1.0.0"
    },
    "RW-QUEEN-CUPS": {
      "name": "Queen of Cups",
      "description": "A Court card of the Minor Arcana, the Queen of Cups is the heart’s deep sea made still. In the Rider–Waite image, she sits upon a seashell-adorned throne at the water’s edge, gazing into an ornate, lidded chalice with angelic handles—an inner sanctum of feeling. Her feet rest near, but not in, the tide, symbolizing compassionate containment and psychic receptivity. She is tenderness refined into wisdom, attuned to currents both spoken and unseen.",
      "keywords": {
        "upright": [
          "compassion",
          "emotional intelligence",
          "empathy",
          "intuition",
          "nurturing",
          "calm receptivity",
          "healing"
        ],
        "reversed": [
          "codependency",
          "emotional overwhelm",
          "insecurity",
          "smothering",
          "martyrdom",
          "blocked intuition",
          "poor boundaries"
        ]
      },
      "meanings": {
        "upright": "Quiet strength and profound empathy guide you now. Hold space for feelings—your own and others’—with wise boundaries and loving presence. Healing flows where gentleness leads.",
        "reversed": "Emotions may spill over or be absorbed to your detriment. Overgiving, moodiness, or self-neglect calls for boundaries, self-soothing, and trusted support."
      },
      "category_meanings": {
        "love": {
          "upright": "A caring, emotionally safe bond deepens. Honest listening and loving reassurance nurture intimacy.",
          "reversed": "Caretaking replaces mutuality or feelings go unvoiced. Re-center on reciprocity and name your needs."
        },
        "career": {
          "upright": "Empathic leadership, counseling skill, or creative stewardship shines. You harmonize teams and protect morale.",
          "reversed": "Absorbing others’ stress or people-pleasing erodes effectiveness. Set limits, delegate, and protect your energy."
        },
        "finance": {
          "upright": "Values-based decisions and compassionate planning. Supportive resources arrive through caring networks.",
          "reversed": "Emotional spending or enabling others financially. Create boundaries and a gentle, realistic budget."
        },
        "health": {
          "upright": "Restorative practices—hydration, soothing routines, and reflective journaling—promote healing.",
          "reversed": "Stress somatization or burnout from caretaking. Seek nurturing support and re-establish restorative boundaries."
        },
        "spiritual": {
          "upright": "Powerful intuitive openings and healing gifts. Sacred silence, water rites, and dreamwork deepen receptivity.",
          "reversed": "Psychic overwhelm or unclear signals. Cleanse your space, simplify practice, and fortify grounding."
        }
      },
      "version": "1.0.0"
    },
    "RW-KING-CUPS": {
      "name": "King of Cups",
      "description": "A Court card of the Minor Arcana, the King of Cups is mastery of the suit of water—feeling held steady. In the Rider–Waite image, he sits on a solid stone throne amid rolling waves, a cup in one hand and scepter in the other; a ship rides the swells and a fish leaps in the distance. Though the sea moves, he remains composed, embodying emotional balance, diplomacy, and depth without drowning.",
      "keywords": {
        "upright": [
          "emotional balance",
          "compassionate authority",
          "diplomacy",
          "wise counsel",
          "stability",
          "maturity",
          "calm leadership"
        ],
        "reversed": [
          "emotional suppression",
          "manipulation",
          "passive aggression",
          "volatility beneath calm",
          "detachment",
          "overcontrol"
        ]
      },
      "meanings": {
        "upright": "You are called to lead with heart and restraint—firm yet compassionate. Steady presence, clear boundaries, and empathy turn rough waters navigable.",
        "reversed": "Feelings may be tightly controlled or wielded to influence others. Avoid withdrawal or manipulation; practice honest expression and balanced boundaries."
      },
      "category_meanings": {
        "love": {
          "upright": "A stable, emotionally mature connection deepens. Safety and trust foster vulnerability and devotion.",
          "reversed": "Emotional distance, mood management, or control tactics. Invite transparent dialogue and shared responsibility."
        },
        "career": {
          "upright": "Thoughtful leadership, mediation, and mentorship. You steer complex dynamics with calm empathy.",
          "reversed": "Bottled stress or politics cloud decisions. Address conflict directly, seek counsel, and model healthy boundaries."
        },
        "finance": {
          "upright": "Measured, values-driven planning stabilizes resources. Compassionate generosity is balanced with prudence.",
          "reversed": "Using money to control or appease emotions. Set clear policies and separate feelings from financial choices."
        },
        "health": {
          "upright": "Emotional regulation supports physical wellbeing. Balanced routines and supportive relationships strengthen resilience.",
          "reversed": "Stress or suppressed feelings impact health. Consider counseling, somatic practices, and mindful release."
        },
        "spiritual": {
          "upright": "Deep, steady intuition and mature compassion guide your path. Serve as a calm anchor for others.",
          "reversed": "Spiritual detachment or performative serenity. Recommit to sincere feeling, humility, and grounded practice."
        }
      },
      "version": "1.0.0"
    }
  },
  "RW-KNIGHT-CUPS": {
    "name": "Knight of Cups",
    "description": "A court card of the Minor Arcana in the suit of Cups, The Knight of Cups rides forward on a calm white horse, holding a golden chalice as if delivering a heartfelt message. Dressed in armor adorned with fish—symbols of intuition—he traverses a quiet landscape of gentle rivers and distant hills. This is the seeker of beauty, romance, and emotional truth, moving with grace, imagination, and sincerity.",
    "keywords": {
      "upright": [
        "romance",
        "idealism",
        "offers",
        "creativity",
        "intuition"
      ],
      "reversed": [
        "unrealistic expectations",
        "emotional volatility",
        "jealousy",
        "projection",
        "escapism"
      ]
    },
    "meanings": {
      "upright": "An invitation, proposal, or heartfelt gesture enters your life. The Knight of Cups brings emotional sincerity, creative inspiration, and a gentle forward movement toward connection. He represents following your heart with intention and grace.",
      "reversed": "Emotions may become muddled, unrealistic, or overly idealized. The reversed Knight of Cups warns of moodiness, broken promises, or pursuing fantasies without grounding. It reflects hesitation, inconsistency, or retreat into escapism."
    },
    "category_meanings": {
      "love": {
        "upright": "A romantic offer, confession, or deepening emotional bond appears. Someone is approaching with genuine feelings, or you feel ready to express your own heart openly.",
        "reversed": "Miscommunication, jealousy, or idealization clouds the relationship. Someone may promise more than they can deliver, or feelings fluctuate unpredictably."
      },
      "career": {
        "upright": "Creative opportunities, collaborative projects, or emotionally fulfilling work arise. You are encouraged to follow career paths that align with your values and artistic instincts.",
        "reversed": "Lack of motivation, inconsistency, or being overly sensitive at work may hinder progress. A project may be fueled more by fantasy than practical planning."
      },
      "finance": {
        "upright": "Money matters improve through intuition-driven decisions or supportive offers. You may feel more confident navigating finances with calm and creativity.",
        "reversed": "Financial decisions may be based on wishful thinking or emotional impulses. Avoid unreliable offers or investments that seem too good to be true."
      },
      "health": {
        "upright": "Emotional balance supports physical wellbeing. Gentle routines, creativity, and stress reduction help you move toward harmony and recovery.",
        "reversed": "Stress, emotional overwhelm, or escapist tendencies may affect your mental or physical health. Grounding practices are needed."
      },
      "spiritual": {
        "upright": "A period of heightened intuition and emotional openness. You feel drawn toward spiritual exploration through art, dreams, or compassionate connection.",
        "reversed": "Spiritual confusion or chasing aesthetic illusions may cloud clarity. You may feel disconnected from your intuition or misinterpret inner signals."
      }
    },
    "version": "1.0.0"
  },
  "RW-QUEEN-CUPS": {
    "name": "Queen of Cups",
    "description": "A court card of the Minor Arcana in the suit of Cups, the Queen of Cups sits upon a throne carved with seashells and mermaids, facing the gentle waves of the ocean. She holds an ornate, lidded chalice—unique in the deck—symbolizing the sacred inner world she protects. Calm, empathetic, and deeply intuitive, she embodies emotional wisdom, compassion, and the quiet power of feeling deeply yet remaining steady.",
    "keywords": {
      "upright": [
        "compassion",
        "intuition",
        "emotional stability",
        "nurturing",
        "sensitivity"
      ],
      "reversed": [
        "emotional insecurity",
        "overwhelm",
        "co-dependence",
        "suppressed feelings",
        "hypersensitivity"
      ]
    },
    "meanings": {
      "upright": "The Queen of Cups represents emotional maturity, intuitive clarity, and gentle compassion. She encourages you to trust your heart, offer support, and honor your inner knowing. This card reflects deep empathy and steady emotional presence.",
      "reversed": "The reversed Queen of Cups signals emotional imbalance, sensitivity to stress, or difficulty maintaining boundaries. Feelings may be suppressed or overwhelming, leading to confusion or self-neglect."
    },
    "category_meanings": {
      "love": {
        "upright": "A nurturing, emotionally safe connection grows. You or your partner express affection openly and with depth. This is a sign of loyalty, tenderness, and intuitive understanding in relationships.",
        "reversed": "Emotional imbalance or over-giving may create strain. Someone may rely too heavily on the other for validation, or feelings may be bottled up instead of shared honestly."
      },
      "career": {
        "upright": "Work benefits from empathy, teamwork, and emotional intelligence. Creative or care-oriented professions thrive. You may be seen as a stabilizing and supportive presence.",
        "reversed": "Stress or emotional overwhelm affects productivity. You may feel underappreciated or drained by workplace dynamics, or boundaries may be unclear."
      },
      "finance": {
        "upright": "Financial intuition is strong, helping you make thoughtful, calm decisions. Support from others or careful budgeting can bring steadiness.",
        "reversed": "Emotional spending or unclear boundaries around money may create issues. Avoid decisions driven by anxiety or guilt."
      },
      "health": {
        "upright": "A gentle, nurturing approach supports healing. Emotional balance strengthens overall wellbeing; practices like meditation or journaling are especially helpful.",
        "reversed": "Stress, emotional suppression, or burnout may affect the body. Prioritize emotional support and rest to regain stability."
      },
      "spiritual": {
        "upright": "A period of heightened intuition and psychic receptivity. You feel more connected to your inner world, dreams, and symbolic messages. Compassion deepens your spiritual journey.",
        "reversed": "Blocked intuition or emotional confusion may cloud spiritual insight. You may feel disconnected from your inner voice or overwhelmed by unprocessed emotions."
      }
    },
    "version": "1.0.0"
  },
  "RW-KING-CUPS": {
    "name": "King of Cups",
    "description": "A court card of the Minor Arcana in the suit of Cups, the King of Cups sits calmly upon a stone throne that floats on a restless sea, waves crashing behind him while he remains unshaken. He holds a golden chalice in one hand and a scepter in the other, symbolizing mastery of both emotion and authority. Despite the turbulent waters, his expression is steady and compassionate, representing emotional balance, diplomacy, and the wisdom gained from navigating deep inner tides.",
    "keywords": {
      "upright": [
        "emotional balance",
        "wisdom",
        "compassion",
        "diplomacy",
        "calm authority"
      ],
      "reversed": [
        "emotional repression",
        "manipulation",
        "moodiness",
        "instability",
        "avoidance"
      ]
    },
    "meanings": {
      "upright": "The King of Cups embodies emotional mastery, kindness, and mature leadership. He encourages staying calm under pressure and responding with compassion rather than force. This card reflects balanced judgment that honors both heart and intellect.",
      "reversed": "The reversed King of Cups warns of suppressed feelings, emotional volatility, or using emotions to influence others. It can signal avoidance of responsibility or difficulty maintaining inner stability."
    },
    "category_meanings": {
      "love": {
        "upright": "A stable, emotionally mature connection is present or arriving. Someone offers steady affection, empathy, and commitment. Conflicts can be resolved peacefully through understanding and compassion.",
        "reversed": "Emotional distance, moodiness, or passive-aggressive behaviors may create confusion. Someone may withhold feelings or struggle with emotional responsibility."
      },
      "career": {
        "upright": "A calm, supportive leader or mentor helps guide your work. You approach challenges diplomatically and handle stress with grace. Roles involving counseling, management, or mediation are favored.",
        "reversed": "Workplace stress may cause emotional shutdown or frustration. Leadership may feel inconsistent, or someone may manipulate situations instead of addressing issues directly."
      },
      "finance": {
        "upright": "A balanced, thoughtful approach to money brings stability. You make calm decisions and avoid emotional extremes. Financial advice from a wise, trustworthy person may be beneficial.",
        "reversed": "Emotional impulsivity or avoidance affects financial choices. Hidden anxieties may lead to inconsistent spending or reluctance to face financial responsibilities."
      },
      "health": {
        "upright": "Emotional equilibrium supports physical health. Stress is manageable, and healthy coping strategies bring inner calm. Therapeutic practices are especially effective now.",
        "reversed": "Emotional suppression or overwhelm may manifest physically. Stress, mood swings, or avoidance can hinder healing, calling for honest self-reflection."
      },
      "spiritual": {
        "upright": "Deep emotional wisdom opens a path to spiritual maturity. You feel grounded and intuitive, able to hold compassion for yourself and others. Inner peace becomes a spiritual guide.",
        "reversed": "Blocked emotions or spiritual detachment may cloud intuition. You may feel disconnected from your inner voice or resist facing deeper truths."
      }
    },
    "version": "1.0.0"
  },
  "RW-ACE-SWORDS": {
    "name": "Ace of Swords",
    "description": "The Ace of Swords is a Minor Arcana seed of the Suit of Swords, the realm of air, mind, and truth. From a clouded sky, a hand emerges holding an upright blade crowned with a laurel wreath, with tiny golden yods falling like sparks of insight. Jagged mountains stand in the distance, suggesting the rigor of reason and the challenge of high ideals. This card captures the first clean cut through confusion, the moment a new idea flashes with dazzling clarity. It is the birth of discernment, victory through truth, and the courage to name what is real.",
    "keywords": {
      "upright": [
        "clarity",
        "breakthrough",
        "truth",
        "intellect",
        "victory",
        "justice"
      ],
      "reversed": [
        "confusion",
        "miscommunication",
        "mental fog",
        "misuse of power",
        "lack of clarity",
        "blocked ideas"
      ]
    },
    "meanings": {
      "upright": "A sharp new perspective arrives, cutting through ambiguity and revealing the core truth. Expect breakthroughs, decisive thinking, and the courage to speak plainly. This is the green light for honesty and clear strategy.",
      "reversed": "Clarity is clouded and words may wound or miss the mark. Be wary of forcing an agenda or confusing cleverness with wisdom. Slow down, untangle the facts, and recalibrate your aim."
    },
    "category_meanings": {
      "love": {
        "upright": "A candid conversation brings clarity; new relationships are built on honesty and mental rapport.",
        "reversed": "Harsh words, mixed messages, or overthinking strain connection. Practice tact and listen as much as you speak."
      },
      "career": {
        "upright": "A winning idea, signed agreement, or decisive plan sets a strong direction. Lead with logic and precision.",
        "reversed": "Unclear goals or conflicting briefs cause stalls. Refine the proposal and align stakeholders before proceeding."
      },
      "finance": {
        "upright": "Sound analysis supports smart financial choices. Favor transparent deals and clear terms.",
        "reversed": "Hidden clauses or fuzzy math. Read the fine print and avoid impulsive commitments."
      },
      "health": {
        "upright": "Diagnosis or understanding brings relief and a clear treatment path. Commit to mental hygiene and focus.",
        "reversed": "Stress and mental clutter impact wellbeing. Simplify inputs and seek a second opinion if unsure."
      },
      "spiritual": {
        "upright": "A piercing insight dissolves doubt. Study, meditation, or prayer yields lucid understanding.",
        "reversed": "Dogma or mental noise drowns intuition. Release rigid thinking and return to first principles."
      }
    },
    "version": "1.0.0"
  },
  "RW-02-SWORDS": {
    "name": "Two of Swords",
    "description": "The Two of Swords is a Minor Arcana crossroads in the Suit of Swords, where mind meets impasse. A blindfolded woman sits on a stone bench by the sea, arms crossed as she balances two heavy blades. The crescent moon hangs over calm waters dotted with rocky islets, hinting at hidden currents and emotions kept at bay. Silence reigns, but the weight of choice is palpable. This is the suspended breath before a decision, the stalemate that asks for inner sight rather than outward force.",
    "keywords": {
      "upright": [
        "stalemate",
        "indecision",
        "truce",
        "inner balance",
        "dilemma",
        "blocked emotions"
      ],
      "reversed": [
        "decision made",
        "information overload",
        "confusion lifting",
        "fear of choice",
        "tension release",
        "avoidance ends"
      ]
    },
    "meanings": {
      "upright": "You face a choice that logic alone cannot settle. Pause, remove the blindfold within, and consult your deeper knowing. Balance precedes movement; neutrality protects while clarity gathers.",
      "reversed": "The pressure to decide breaks the stalemate, though confusion may still linger. Avoid paralysis by over-analysis; choose a direction and adjust along the way."
    },
    "category_meanings": {
      "love": {
        "upright": "Guarded hearts and unspoken truths create distance. Make space for a calm, honest exchange.",
        "reversed": "A decision about commitment or separation emerges. Don’t let fear choose for you."
      },
      "career": {
        "upright": "Project stalemate or competing priorities. Step back, weigh facts, and set clear criteria.",
        "reversed": "A delayed decision lands. Accept trade-offs and move the plan forward."
      },
      "finance": {
        "upright": "Hold steady while assessing options; avoid impulsive moves. Gather missing information.",
        "reversed": "Analysis paralysis breaks, but verify numbers before committing."
      },
      "health": {
        "upright": "Body signals are muted by stress. Create quiet time to listen and restore balance.",
        "reversed": "Choose a treatment path and reduce conflicting advice. Consistency heals."
      },
      "spiritual": {
        "upright": "Meditation over motion. Inner neutrality opens a subtler truth.",
        "reversed": "Lift the blindfold of doubt; act on what you already know."
      }
    },
    "version": "1.0.0"
  },
  "RW-03-SWORDS": {
    "name": "Three of Swords",
    "description": "The Three of Swords is a Minor Arcana emblem of piercing truth in the Suit of Swords. Against a slate sky, rain falls as three blades drive straight through a red heart suspended in the air. There is no scenery to soften the moment—only the storm and the wound laid bare. Yet storms pass, and the air clears. This card honors the honest ache that accompanies loss, betrayal, or realization, and the cleansing that follows when tears have done their work.",
    "keywords": {
      "upright": [
        "heartbreak",
        "sorrow",
        "grief",
        "separation",
        "painful truth",
        "catharsis"
      ],
      "reversed": [
        "recovery",
        "forgiveness",
        "release of pain",
        "mending",
        "lingering sadness",
        "acceptance"
      ]
    },
    "meanings": {
      "upright": "A sharp sorrow or difficult truth pierces the heart, bringing clarity through pain. Allow the feelings to flow—this is a necessary storm that washes the air clean.",
      "reversed": "The worst has peaked; healing begins. Old wounds call for gentle closure and forgiveness, including of yourself."
    },
    "category_meanings": {
      "love": {
        "upright": "Breakups, disappointment, or harsh revelations. Speak tenderly and allow space to grieve.",
        "reversed": "Reconciliation or healing after hurt. Boundaries and apologies rebuild trust."
      },
      "career": {
        "upright": "Setbacks, criticism, or a painful pivot. Let feedback refine your path.",
        "reversed": "Repair strained alliances or morale. Learn and move on with clearer intent."
      },
      "finance": {
        "upright": "Loss or unexpected expense stings. Stabilize and make a recovery plan.",
        "reversed": "Gradual financial healing; debts or losses begin to ease."
      },
      "health": {
        "upright": "Stress and emotional pain impact vitality. Seek support and gentle routines.",
        "reversed": "Therapy, rest, or treatment restores strength; scars become wisdom."
      },
      "spiritual": {
        "upright": "A dark night of the soul that reveals deeper truths. Surrender opens the heart.",
        "reversed": "Integration of past pain into compassion and purpose."
      }
    },
    "version": "1.0.0"
  },
  "RW-04-SWORDS": {
    "name": "Four of Swords",
    "description": "The Four of Swords is a Minor Arcana sanctuary within the Suit of Swords. In a quiet chapel, a recumbent knight rests upon a tomb, hands folded in prayer; three swords hang upon the wall while a fourth lies beneath him. A stained-glass window depicts a supplicant before a holy figure, casting colored light into the stillness. This is sacred pause after conflict, a retreat where mind and spirit can knit themselves whole. Silence becomes strategy; rest becomes renewal.",
    "keywords": {
      "upright": [
        "rest",
        "recuperation",
        "meditation",
        "timeout",
        "recovery",
        "strategic pause"
      ],
      "reversed": [
        "restlessness",
        "burnout",
        "delayed healing",
        "need to slow down",
        "overextension",
        "stagnation"
      ]
    },
    "meanings": {
      "upright": "Withdraw to restore. In stillness your thoughts settle, your strategy clarifies, and your strength returns.",
      "reversed": "Pushing through exhaustion backfires. Create boundaries, simplify commitments, and prioritize true rest."
    },
    "category_meanings": {
      "love": {
        "upright": "A cooling period or gentle space aids understanding. Quiet presence heals more than arguments.",
        "reversed": "Emotional withdrawal or avoidance. Re-engage when rested, not reactive."
      },
      "career": {
        "upright": "Pause after a sprint; consolidate learnings, plan the next move. Sustainable pacing wins.",
        "reversed": "Overwork erodes performance. Take leave or redistribute workload."
      },
      "finance": {
        "upright": "Hold steady; build reserves and review budgets calmly.",
        "reversed": "Financial stress from constant activity. Stop, reassess, and cut unnecessary outflows."
      },
      "health": {
        "upright": "Recovery period; sleep, therapy, or retreat supports healing.",
        "reversed": "Ignoring signals of fatigue. Schedule rest as if it were medicine."
      },
      "spiritual": {
        "upright": "Retreat, contemplation, and prayer realign your inner compass.",
        "reversed": "Spiritual dryness from busyness. Create a sacred routine of quiet."
      }
    },
    "version": "1.0.0"
  },
  "RW-05-SWORDS": {
    "name": "Five of Swords",
    "description": "The Five of Swords is a Minor Arcana reckoning in the Suit of Swords. On a windswept shore, a figure gathers swords with a crooked smile while two others walk away dejected. The sky is unsettled, and the victory rings hollow. Words may have cut deeper than intended; pride may have cost more than it gained. This card asks what winning means when respect and connection are lost along the way.",
    "keywords": {
      "upright": [
        "conflict",
        "win-at-all-costs",
        "betrayal",
        "hollow victory",
        "tension",
        "sharp words"
      ],
      "reversed": [
        "reconciliation",
        "making amends",
        "learning from conflict",
        "compromise",
        "lingering resentment",
        "turning point"
      ]
    },
    "meanings": {
      "upright": "Conflict has produced a questionable win. Consider the human cost and whether another approach could preserve integrity.",
      "reversed": "It’s time to lay down arms, make amends, or walk away from toxic battles. Seek repair over righteousness."
    },
    "category_meanings": {
      "love": {
        "upright": "Point scoring and sarcasm damage intimacy. Step back, cool off, and choose empathy.",
        "reversed": "Apologies and boundaries mend rifts. Focus on mutual respect over being right."
      },
      "career": {
        "upright": "Office politics or underhanded tactics succeed for now but harm trust. Elevate the standard.",
        "reversed": "Conflict resolution and team repair. Define fair rules of engagement."
      },
      "finance": {
        "upright": "Risky gains with ethical shadows. Avoid schemes that cost reputation.",
        "reversed": "Cut losses, renegotiate terms, and rebuild on transparent foundations."
      },
      "health": {
        "upright": "Stress from conflict drains energy. Mind-body practices restore equilibrium.",
        "reversed": "Letting go of grudges reduces symptoms; prioritize peaceful environments."
      },
      "spiritual": {
        "upright": "Ego battles obscure wisdom. Humility opens the path.",
        "reversed": "Choose peace and atonement; the lesson becomes integration."
      }
    },
    "version": "1.0.0"
  },
  "RW-06-SWORDS": {
    "name": "Six of Swords",
    "description": "The Six of Swords is a Minor Arcana passage in the Suit of Swords. A ferryman poles a small boat across gray water, carrying a cloaked figure and child from choppy waves toward a calmer shore; six swords stand in the boat like silent passengers. The sky is muted, the mood sober yet hopeful. This is transition after turmoil, the quiet decision to move on carrying only what is necessary. Healing comes mid-journey, not only upon arrival.",
    "keywords": {
      "upright": [
        "transition",
        "moving on",
        "recovery",
        "passage",
        "travel",
        "mental relief"
      ],
      "reversed": [
        "stuck",
        "delays",
        "unresolved baggage",
        "difficulty moving on",
        "return to trouble",
        "resistance"
      ]
    },
    "meanings": {
      "upright": "You are crossing from difficulty to steadier ground. Trust the process, even if the waters are still gray; each stroke takes you farther from the storm.",
      "reversed": "Old issues weigh down the boat. Lighten the load, ask for help, and finalize what remains unfinished."
    },
    "category_meanings": {
      "love": {
        "upright": "Healing conversations and gentle distance from past drama. A relationship moves into calmer waters or you find peace after parting.",
        "reversed": "Unresolved patterns resurface. Seek counseling or pause before moving on."
      },
      "career": {
        "upright": "Transition to a better role or workflow; a project leaves crisis mode. Quiet progress.",
        "reversed": "Change stalls from unclosed loops. Document lessons and clear the backlog."
      },
      "finance": {
        "upright": "Gradual improvement and stability; debt management or restructuring helps.",
        "reversed": "Carrying debts without a plan. Negotiate terms and set milestones."
      },
      "health": {
        "upright": "Recovery phase; steady routines support healing. Be patient with pacing.",
        "reversed": "Relapses or delays indicate unresolved causes. Adjust treatment and supports."
      },
      "spiritual": {
        "upright": "A guided passage from confusion to clarity. Let mentors or practices ferry you along.",
        "reversed": "Clinging to old narratives blocks growth. Release and recommit to the journey."
      }
    },
    "version": "1.0.0"
  },
  "RW-07-SWORDS": {
    "name": "Seven of Swords",
    "description": "The Seven of Swords is a Minor Arcana gambit in the Suit of Swords. Under a pale sky, a figure tiptoes from a camp of bright tents, five swords in hand while two remain behind; he glances back with a sly, calculating look. This is the art of strategy—sometimes stealth, sometimes solitude—used to navigate contested terrain. Cleverness can protect, but it can also deceive. The question is whether your plan aligns with integrity or evasion.",
    "keywords": {
      "upright": [
        "strategy",
        "tactics",
        "stealth",
        "independence",
        "cunning",
        "resourcefulness"
      ],
      "reversed": [
        "coming clean",
        "getting caught",
        "self-deception",
        "imposter syndrome",
        "conscience",
        "rethinking tactics"
      ]
    },
    "meanings": {
      "upright": "A strategic, unconventional approach is called for. Move quietly, think ahead, and take only what you can carry with a clear conscience.",
      "reversed": "Evasion backfires or weighs on the heart. Own the truth, adjust the plan, and rebuild trust."
    },
    "category_meanings": {
      "love": {
        "upright": "Privacy and autonomy matter, but secrecy corrodes. Be upfront about needs and boundaries.",
        "reversed": "Confessions or revelations clear the air. Recommit to transparency."
      },
      "career": {
        "upright": "Operate strategically—pilot projects, test quietly, avoid unnecessary exposure.",
        "reversed": "Shortcuts or hidden agendas surface. Shift to collaboration and documented processes."
      },
      "finance": {
        "upright": "Lean tactics: reduce waste, negotiate, and secure assets discretely.",
        "reversed": "Errors or omissions come due. Clean up records and be fully compliant."
      },
      "health": {
        "upright": "Personalized, low-profile routines work best. Track habits and protect your time.",
        "reversed": "Avoid self-sabotage or cutting corners. Seek accountability and professional guidance."
      },
      "spiritual": {
        "upright": "Practice discernment; not every path needs public display.",
        "reversed": "Drop the mask. Authenticity is the strongest protection."
      }
    },
    "version": "1.0.0"
  },
  "RW-08-SWORDS": {
    "name": "Eight of Swords",
    "description": "The Eight of Swords is a Minor Arcana bind within the Suit of Swords. A blindfolded woman stands bound on muddy ground, encircled by eight swords that form a loose cage; a distant stronghold rises beyond the mist. The tide is low and the path is slippery, yet an opening awaits if she can turn to see it. This card speaks of mental prisons and stories that shrink our choices. What binds can be unbound when the mind regains its sight.",
    "keywords": {
      "upright": [
        "restriction",
        "paralysis",
        "fear",
        "self-limiting beliefs",
        "entrapment",
        "overthinking"
      ],
      "reversed": [
        "release",
        "empowerment",
        "new perspective",
        "liberation",
        "self-acceptance",
        "taking off the blindfold"
      ]
    },
    "meanings": {
      "upright": "You feel trapped by circumstances or anxious thoughts. The cage is looser than it seems—steady yourself, seek help, and take one small, clear step.",
      "reversed": "The knots begin to loosen. A shift in thinking restores mobility and choice; claim your exit."
    },
    "category_meanings": {
      "love": {
        "upright": "Fear of vulnerability blocks intimacy. Share gently and challenge negative assumptions.",
        "reversed": "A constricting dynamic eases. Healthier boundaries and communication emerge."
      },
      "career": {
        "upright": "Stuck in a role or project by limiting beliefs or politics. Map options and ask for support.",
        "reversed": "A bottleneck clears; you negotiate freedom or a better remit."
      },
      "finance": {
        "upright": "Debt or scarcity mindset feels suffocating. Create a simple, non-punitive plan.",
        "reversed": "You find room to maneuver—consolidation, negotiation, or new income."
      },
      "health": {
        "upright": "Anxiety or negative loops hamper progress. Gentle structure and therapy help.",
        "reversed": "Mental relief and better habits unlock momentum."
      },
      "spiritual": {
        "upright": "Beliefs that once protected now confine. Question the story; freedom is nearer than you think.",
        "reversed": "A breakthrough in self-trust releases old vows of smallness."
      }
    },
    "version": "1.0.0"
  },
  "RW-09-SWORDS": {
    "name": "Nine of Swords",
    "description": "The Nine of Swords is a Minor Arcana midnight in the Suit of Swords. In a dark room, a figure sits upright in bed, face in hands, as nine swords loom on the wall like troubling thoughts. A quilt stitched with roses and zodiac symbols wraps the sleeper, hinting at cycles and the promise of dawn. This is anxiety, guilt, or grief replayed in the mind’s theater. Though the night feels long, morning comes, and with it, perspective and care.",
    "keywords": {
      "upright": [
        "anxiety",
        "sleeplessness",
        "worry",
        "remorse",
        "nightmares",
        "mental anguish"
      ],
      "reversed": [
        "release of anxiety",
        "coping",
        "perspective",
        "self-compassion",
        "healing the mind",
        "light after darkness"
      ]
    },
    "meanings": {
      "upright": "Fear and rumination amplify in the quiet hours. Name the worry, seek support, and interrupt the spiral with compassionate structure.",
      "reversed": "The mind softens its grip. Coping tools work, and burdens lighten as you share them."
    },
    "category_meanings": {
      "love": {
        "upright": "Insecurity and imagined scenarios strain closeness. Communicate vulnerably and reality-check fears.",
        "reversed": "Reassurance and honest dialogue quiet the mind; trust rebuilds."
      },
      "career": {
        "upright": "Pressure, deadlines, or mistakes haunt your thoughts. Prioritize, delegate, and ask for help.",
        "reversed": "Workable plans and boundaries reduce stress; progress feels possible."
      },
      "finance": {
        "upright": "Financial worries loom larger at night. Make a practical budget and timeline.",
        "reversed": "Relief through payment plans, advice, or unexpected assistance."
      },
      "health": {
        "upright": "Insomnia and stress require gentle, consistent care. Mindfulness and routine soothe.",
        "reversed": "Improved sleep and mood; therapy or treatment takes hold."
      },
      "spiritual": {
        "upright": "Shadow work arises; meet it with compassion, not judgment.",
        "reversed": "Integration and peace follow the courage to face what frightened you."
      }
    },
    "version": "1.0.0"
  },
  "RW-10-SWORDS": {
    "name": "Ten of Swords",
    "description": "The Ten of Swords is a Minor Arcana terminus in the Suit of Swords. A figure lies face down with ten swords in the back under a blackened sky; yet on the horizon, a sunrise breaks over calm waters. The image is stark: an ending, an overkill, the finality of what cannot continue. And still, dawn insists. This card marks the lowest ebb and the invitation to stand again, lighter for what is truly finished.",
    "keywords": {
      "upright": [
        "endings",
        "rock bottom",
        "betrayal",
        "overwhelm",
        "finality",
        "release"
      ],
      "reversed": [
        "recovery",
        "regeneration",
        "survival",
        "resilience",
        "resisting an ending",
        "renewal"
      ]
    },
    "meanings": {
      "upright": "A cycle ends decisively, perhaps painfully. Accept the truth, let go with dignity, and make space for the emerging dawn.",
      "reversed": "You rise after the fall. Healing begins, or you resist an ending that needs to happen—choose renewal."
    },
    "category_meanings": {
      "love": {
        "upright": "A relationship or pattern reaches its endpoint. Honor closure and seek support.",
        "reversed": "Second chances after crisis or a necessary breakup leads to relief and rebirth."
      },
      "career": {
        "upright": "A role, project, or strategy is done. Acknowledge the loss and plan a reset.",
        "reversed": "Rebound after burnout or layoff; new opportunities appear as you release the old."
      },
      "finance": {
        "upright": "A financial low point or hard stop. Avoid drastic moves; build from zero with realism.",
        "reversed": "Debts resolved or recovery underway; wiser stewardship follows."
      },
      "health": {
        "upright": "Exhaustion or acute stress signals a full stop. Rest and professional care are essential.",
        "reversed": "Energy returns after crisis; commit to sustainable habits."
      },
      "spiritual": {
        "upright": "Ego narratives collapse; surrender opens a clear horizon.",
        "reversed": "Phoenix energy—renewed purpose from ashes and humility."
      }
    },
    "version": "1.0.0"
  },
  "RW-PAGE-SWORDS": {
    "name": "Page of Swords",
    "description": "A court card of the Minor Arcana in the suit of Swords, the Page of Swords depicts a keen-eyed youth standing on a windswept hill, sword held upright and ready while their head turns alertly over one shoulder. The sky is alive with swift clouds and circling birds, and the grasses bend in the breeze, suggesting messages carried on the wind. The ground is bright and uneven, and distant mountains hint at challenges yet to be explored. This Page embodies the first spark of intellect and communication—curiosity sharpened into vigilance, the courage to ask questions, and the readiness to learn, speak, and move with agile clarity.",
    "keywords": {
      "upright": [
        "curiosity",
        "vigilance",
        "new ideas",
        "communication",
        "inquiry",
        "alertness",
        "mental agility",
        "truth-seeking"
      ],
      "reversed": [
        "gossip",
        "haste",
        "restlessness",
        "miscommunication",
        "paranoia",
        "immaturity",
        "scatterbrained",
        "defensiveness"
      ]
    },
    "meanings": {
      "upright": "Fresh ideas are stirring, and a message or conversation invites you to think on your feet. Stay inquisitive and clear; this is a time for research, observation, and honest dialogue.",
      "reversed": "Words may fly faster than thought, leading to crossed wires or half-formed plans. Slow down, verify information, and temper defensiveness with openness."
    },
    "category_meanings": {
      "love": {
        "upright": "Flirtation and lively conversation spark connection; honesty and curiosity strengthen bonds. Ask questions and share your thoughts openly.",
        "reversed": "Mixed signals, snooping, or hypersensitivity to words can create friction. Avoid jumping to conclusions and clarify before reacting."
      },
      "career": {
        "upright": "An opportunity to learn, interview, research, or present ideas. Sharpen your questions and document facts to advance.",
        "reversed": "Office gossip, impatience, or rushed emails could undermine credibility. Proofread, verify sources, and pace your delivery."
      },
      "finance": {
        "upright": "Gather data, compare offers, and read the fine print; small, smart steps accumulate. Education about money pays off now.",
        "reversed": "Beware of dubious tips and impulsive purchases. Delay decisions until you have solid, verifiable information."
      },
      "health": {
        "upright": "A good time to research treatments, track habits, and seek second opinions. Mental stimulation and clear routines support wellbeing.",
        "reversed": "Anxiety, overthinking, or inconsistent habits may drain energy. Reduce noise, verify advice, and create a simple plan."
      },
      "spiritual": {
        "upright": "Study, journal, and question your assumptions to refine your path. Seek truth through inquiry and mindful observation.",
        "reversed": "Cynicism or scattered practices cloud insight. Simplify, listen deeply, and rebuild trust in your inner voice."
      }
    },
    "version": "1.0.0"
  },
  "RW-KNIGHT-SWORDS": {
    "name": "Knight of Swords",
    "description": "A court card of the Minor Arcana in the suit of Swords, the Knight of Swords charges across a plain on a white horse, sword thrust forward as a gale whips his red plume and the trees bend in the distance. The sky is streaked with restless clouds; motion and intent dominate the scene. This Knight is fierce clarity in action—swift decisions, bold pursuit, and the drive to cut straight to the point—an embodiment of the air element at full speed.",
    "keywords": {
      "upright": [
        "action",
        "decisiveness",
        "ambition",
        "momentum",
        "directness",
        "courage",
        "focus",
        "assertiveness"
      ],
      "reversed": [
        "recklessness",
        "impulsivity",
        "conflict",
        "haste",
        "burnout",
        "insensitivity",
        "scattered energy",
        "argumentativeness"
      ]
    },
    "meanings": {
      "upright": "Charge ahead with clarity and purpose; the path clears when you act decisively. Speak plainly, cut through confusion, and let momentum work for you.",
      "reversed": "Rushing, forcing, or arguing for argument’s sake leads to friction. Pause to align intent with impact and consider consequences before acting."
    },
    "category_meanings": {
      "love": {
        "upright": "Rapid developments and frank conversations move a relationship forward. Honesty and shared aims are crucial.",
        "reversed": "Harsh words, impatience, or competitive dynamics can inflame tension. Slow the pace and listen as much as you speak."
      },
      "career": {
        "upright": "A decisive push on a project, bold pitch, or rapid turnaround. Take the lead and communicate directives clearly.",
        "reversed": "Impulsive choices or combative communication may alienate allies. Refine strategy, set priorities, and curb haste."
      },
      "finance": {
        "upright": "Quick negotiations or time-sensitive deals can benefit you if your facts are solid. Act, but stay factual and unemotional.",
        "reversed": "Risky trades, buyer’s remorse, or contractual oversights are likely when rushing. Read terms carefully and delay if uncertain."
      },
      "health": {
        "upright": "A surge of energy supports a disciplined plan or physical training. Channel vigor with structure.",
        "reversed": "Overexertion, minor injuries, or stress spikes from nonstop pace. Use protective measures and build in recovery."
      },
      "spiritual": {
        "upright": "Cut away distraction and commit to a clear path. Seek truth with intellectual courage.",
        "reversed": "Dogmatism or debate eclipses wisdom. Practice humility and let insight arise between the words."
      }
    },
    "version": "1.0.0"
  },
  "RW-QUEEN-SWORDS": {
    "name": "Queen of Swords",
    "description": "A court card of the Minor Arcana in the suit of Swords, the Queen of Swords sits upright on a stone throne carved with butterflies and cherubic faces, a symbol of transformation and keen perception. She holds her sword vertical and extends her free hand as if to invite truth forward, while a clear sky opens beyond drifting clouds and distant mountains. She is the union of intellect and lived experience—discerning, independent, and candid—offering clarity with compassion tempered by firm boundaries.",
    "keywords": {
      "upright": [
        "discernment",
        "truth",
        "independence",
        "boundaries",
        "objectivity",
        "perception",
        "maturity",
        "clear communication"
      ],
      "reversed": [
        "coldness",
        "bitterness",
        "isolation",
        "criticism",
        "rigidity",
        "cynicism",
        "sharp tongue",
        "overanalysis"
      ]
    },
    "meanings": {
      "upright": "Think and speak with measured clarity; experience has honed your judgment. Set healthy boundaries and choose words that are honest and precise.",
      "reversed": "Emotional distance or harsh critiques may be blocking connection. Reintroduce warmth, challenge assumptions, and soften rigid stances."
    },
    "category_meanings": {
      "love": {
        "upright": "Candid conversations and high standards bring a relationship into truthful alignment. Respect for boundaries deepens trust.",
        "reversed": "Walls may be too high, or words too cutting. Practice empathy and let vulnerability share space with logic."
      },
      "career": {
        "upright": "Strategic thinking, fair policy-making, and clear directives. Your judgment is valued; mentor and set standards.",
        "reversed": "Micromanagement, aloof leadership, or overly harsh reviews dampen morale. Balance critique with constructive support."
      },
      "finance": {
        "upright": "Plan, audit, and negotiate with precision. Facts and fairness guide prudent choices.",
        "reversed": "Penny-pinching or fear-based decisions may limit growth. Reassess assumptions and seek objective advice."
      },
      "health": {
        "upright": "Evidence-based care, mental clarity, and consistent routines benefit wellbeing. Track data to guide choices.",
        "reversed": "Suppressing feelings or self-criticism can affect health. Invite support and integrate emotional care."
      },
      "spiritual": {
        "upright": "Cut through self-deception with lucid self-inquiry. Discernment clarifies your path.",
        "reversed": "Cynicism blocks intuition. Blend reason with receptive, heart-centered practices."
      }
    },
    "version": "1.0.0"
  },
  "RW-KING-SWORDS": {
    "name": "King of Swords",
    "description": "A court card of the Minor Arcana in the suit of Swords, the King of Swords sits facing forward on a high stone throne, its carvings of butterflies and crescent motifs hinting at reason’s sovereignty over change and instinct. He holds his sword upright like a scepter, robes and mantle composed, the sky pale blue with feathered clouds and wind-tossed trees in the distance. This King embodies the apex of mental mastery—ethical authority, strategic thinking, and impartial judgment wielded with calm precision.",
    "keywords": {
      "upright": [
        "authority",
        "truth",
        "logic",
        "integrity",
        "strategy",
        "judgment",
        "leadership",
        "law",
        "clarity"
      ],
      "reversed": [
        "abuse of power",
        "manipulation",
        "rigidity",
        "cold logic",
        "bias",
        "tyranny",
        "intellectual arrogance",
        "unfairness"
      ]
    },
    "meanings": {
      "upright": "Lead with clarity, ethics, and firm reasoning. Make decisions based on facts and principle, and communicate with composed authority.",
      "reversed": "Overcontrol or sharp-edged logic may slip into domination or unfairness. Re-center on integrity, check biases, and invite counsel."
    },
    "category_meanings": {
      "love": {
        "upright": "Clear agreements, honest boundaries, and mature communication strengthen bonds. A partner may be stable, principled, and direct.",
        "reversed": "Power imbalances or emotional detachment breed tension. Avoid controlling tactics and speak from fairness as well as feeling."
      },
      "career": {
        "upright": "Strategic leadership, legal or analytical success, and decisions that set standards. Your authority is earned through competence and integrity.",
        "reversed": "Authoritarian management, cutting remarks, or unethical choices erode trust. Invite dialogue and uphold due process."
      },
      "finance": {
        "upright": "Create a structured plan, negotiate contracts carefully, and consult experts. Clarity and compliance safeguard resources.",
        "reversed": "Unfair terms, legal snags, or rigid thinking can cost you. Review documents, challenge biases, and seek impartial advice."
      },
      "health": {
        "upright": "Follow evidence-based protocols and professional guidance. Consistency and measured tracking support recovery.",
        "reversed": "Overregimentation or stress from perfectionism may backfire. Loosen rigidity and include restorative practices."
      },
      "spiritual": {
        "upright": "Moral clarity and disciplined study align your path with truth. Let principle guide practice.",
        "reversed": "Dogma eclipses wisdom when compassion is excluded. Rebalance head and heart to restore insight."
      }
    },
    "version": "1.0.0"
  },
  "RW-ACE-PENTACLES": {
    "name": "Ace of Pentacles",
    "description": "The Ace of Pentacles opens the Minor Arcana’s earthy suit with a promise of the tangible made real. From a white cloud, a hand presents a golden pentacle like a seed, hovering above a lush garden and a flowering archway that leads to distant mountains. It is the moment when potential meets soil, when a path appears underfoot and the world quietly says: plant this, tend it, and watch life grow solid and generous around you.",
    "keywords": {
      "upright": [
        "new opportunity",
        "prosperity",
        "manifestation",
        "grounded beginnings",
        "abundance",
        "tangible results"
      ],
      "reversed": [
        "missed opportunity",
        "scarcity mindset",
        "instability",
        "delay",
        "short-term focus",
        "disconnection from body"
      ]
    },
    "meanings": {
      "upright": "A fresh material beginning arrives — a job, offer, gift, or fertile idea with real-world promise. Plant the seed and nurture it with steady effort; practical action will bear fruit.",
      "reversed": "Potential is blocked or feared, often by doubt or clinging to safety. Re-ground, simplify your plan, and prepare the soil so opportunity can take root."
    },
    "category_meanings": {
      "love": {
        "upright": "A steady new start or a chance to build a secure bond. Show care through consistent, practical gestures.",
        "reversed": "Treating affection as a transaction or hesitating to invest in trust. Open your heart as well as your schedule."
      },
      "career": {
        "upright": "A job offer, promising project, or material support arrives. Begin with clear plans and reliable habits.",
        "reversed": "An offer lacks substance or timing feels off. Clarify terms, strengthen skills, and wait for firmer footing."
      },
      "finance": {
        "upright": "A gift, bonus, or pathway to long-term stability. Start savings, invest wisely, and think in seasons, not days.",
        "reversed": "Unexpected costs or shaky budgeting. Tighten basics, avoid impulsive buys, and rebuild a solid base."
      },
      "health": {
        "upright": "Foundations improve through sleep, nutrition, and gentle routines. Your body responds to consistent care.",
        "reversed": "Neglecting fundamentals or starting too hard, too fast. Return to simple, grounded habits."
      },
      "spiritual": {
        "upright": "Embodiment and presence become sacred practice. Touch the earth; let spirit root in daily life.",
        "reversed": "Spiritual materialism or disconnection from the body. Seek humility and tactile rituals to reconnect."
      }
    },
    "version": "1.0.0"
  },
  "RW-02-PENTACLES": {
    "name": "Two of Pentacles",
    "description": "The Two of Pentacles dances with the flux of the everyday. A lively figure juggles two coins threaded by an infinity ribbon, while behind him ships ride high waves, rising and falling with the tide. This Minor Arcana card speaks in the language of balance-in-motion: a playful, practiced rhythm that keeps life’s changing weights aloft.",
    "keywords": {
      "upright": [
        "balance",
        "adaptability",
        "time management",
        "flexibility",
        "prioritization",
        "flow"
      ],
      "reversed": [
        "overwhelm",
        "imbalance",
        "overcommitment",
        "disorganization",
        "dropped responsibilities",
        "stress"
      ]
    },
    "meanings": {
      "upright": "You are managing multiple demands; keep your steps light and your priorities clear. With flexibility and honest scheduling, you can keep everything in motion.",
      "reversed": "Too many balls in the air are beginning to fall. Simplify, delegate, and re-order your commitments before the tide pulls you under."
    },
    "category_meanings": {
      "love": {
        "upright": "A playful connection that needs mindful scheduling. Balance romance with life’s other responsibilities.",
        "reversed": "Mood swings or logistics strain the bond. Pare down obligations or the relationship may feel neglected."
      },
      "career": {
        "upright": "Multitasking and agile project management pay off. Use checklists and boundaries to stay on beat.",
        "reversed": "Scattered focus and shifting priorities. Streamline workflows and say no where needed."
      },
      "finance": {
        "upright": "Cash flow ebbs and flows; budgeting evens the tide. Move money consciously between needs.",
        "reversed": "Juggling debts or paying robbing Peter to pay Paul. Consolidate and create a realistic plan."
      },
      "health": {
        "upright": "Work-life balance supports vitality. Alternate exertion with recovery.",
        "reversed": "Burnout risk from poor pacing. Lighten the load and set restorative routines."
      },
      "spiritual": {
        "upright": "Integrate practice into daily rhythms — small, frequent rituals. Balance inner work with outer life.",
        "reversed": "Spiritual neglect due to busyness. Carve out protected, undistracted time."
      }
    },
    "version": "1.0.0"
  },
  "RW-03-PENTACLES": {
    "name": "Three of Pentacles",
    "description": "In a cathedral’s half-finished hush, a skilled mason stands on a bench, tools in hand, while a robed monk and an architect with plans confer beneath an arched carving of three pentacles. This card celebrates the Minor Arcana’s devotion to craft and cooperation — vision drafted, skill applied, and structure taking dignified form.",
    "keywords": {
      "upright": [
        "collaboration",
        "craftsmanship",
        "planning",
        "teamwork",
        "recognition",
        "apprenticeship"
      ],
      "reversed": [
        "poor workmanship",
        "misalignment",
        "lack of planning",
        "ego clashes",
        "silos",
        "miscommunication"
      ]
    },
    "meanings": {
      "upright": "Shared effort and clear roles produce quality results. Your skills are seen; align plans and standards to build something that lasts.",
      "reversed": "Working at cross-purposes undermines outcomes. Revisit plans, clarify expectations, and raise the bar together."
    },
    "category_meanings": {
      "love": {
        "upright": "Build the relationship like a beautiful structure: communicate, plan, and celebrate each other’s strengths.",
        "reversed": "One partner carries the project while the other resists. Rebalance duties and revisit shared goals."
      },
      "career": {
        "upright": "Effective teamwork and expert guidance move a project forward. Your competence is valued.",
        "reversed": "Unclear roles and turf wars. Define responsibilities and set quality benchmarks."
      },
      "finance": {
        "upright": "Plan long-term with advice from professionals. Systems create stability.",
        "reversed": "Disorganized budgeting or DIY beyond your skill. Seek counsel and tighten methods."
      },
      "health": {
        "upright": "A structured plan and expert support foster improvement. Consistency builds strength.",
        "reversed": "Inconsistent routines or ignoring guidance. Return to basics and follow the plan."
      },
      "spiritual": {
        "upright": "Study within a lineage or community. Shared practice refines understanding.",
        "reversed": "Pride resists guidance. Humility opens the door to growth."
      }
    },
    "version": "1.0.0"
  },
  "RW-04-PENTACLES": {
    "name": "Four of Pentacles",
    "description": "A seated figure clutches a coin to his chest, one rests upon his crown, and two are pinned beneath his feet, while a city lies just behind him. The Minor Arcana’s earth here becomes a fortress — safety held tightly, yet at risk of becoming a cage. The card whispers of stability hard-won and the soft art of letting the grip ease.",
    "keywords": {
      "upright": [
        "security",
        "conservation",
        "boundaries",
        "control",
        "saving",
        "stability"
      ],
      "reversed": [
        "greed",
        "fear of loss",
        "stagnation",
        "overcontrol",
        "release",
        "vulnerability"
      ]
    },
    "meanings": {
      "upright": "Protect your resources and consolidate gains. Just take care that caution does not harden into rigidity.",
      "reversed": "Loosen a clenched hold on money, time, or emotions. Share, invest, and allow circulation to invite growth."
    },
    "category_meanings": {
      "love": {
        "upright": "Steady commitment shaped by healthy boundaries. Security nourishes intimacy.",
        "reversed": "Possessiveness or emotional withholding. Trust grows when you open your hands."
      },
      "career": {
        "upright": "Maintain your position and guard key assets. Systems and reserves matter now.",
        "reversed": "Micromanagement or resistance to change. Delegate and adapt to evolve."
      },
      "finance": {
        "upright": "Save diligently and build an emergency fund. Caution supports long-term goals.",
        "reversed": "Hoarding or fear-driven spending. Create a balanced plan and circulate wisely."
      },
      "health": {
        "upright": "Grounding routines and steady sleep nourish resiliency.",
        "reversed": "Tension and tightness suggest the need to relax, stretch, and breathe."
      },
      "spiritual": {
        "upright": "Root into gratitude and presence; stability can be sacred.",
        "reversed": "Attachment to material status blocks the heart. Practice generosity."
      }
    },
    "version": "1.0.0"
  },
  "RW-05-PENTACLES": {
    "name": "Five of Pentacles",
    "description": "Snow falls on two weary figures who pass a stained-glass window glowing with five pentacles. One limps on crutches; the other hunches against the cold. This Minor Arcana card shows material hardship and the ache of exclusion — yet the warm light nearby hints that refuge is closer than it seems.",
    "keywords": {
      "upright": [
        "hardship",
        "scarcity",
        "isolation",
        "illness",
        "loss",
        "support nearby"
      ],
      "reversed": [
        "recovery",
        "assistance",
        "renewed hope",
        "improvement",
        "resilience",
        "reentry"
      ]
    },
    "meanings": {
      "upright": "A season of lack, fatigue, or feeling shut out. Ask for help; community and resources are within reach.",
      "reversed": "A turning point arrives as aid, perspective, or health improves. Step toward the light and accept support."
    },
    "category_meanings": {
      "love": {
        "upright": "Loneliness within or outside a relationship; warmth returns through honest vulnerability.",
        "reversed": "Compassion and care rebuild trust. Reconnection is possible."
      },
      "career": {
        "upright": "Job insecurity or a setback. Network, upskill, and seek allies.",
        "reversed": "Leads open, interviews land, or a mentor appears. Keep moving."
      },
      "finance": {
        "upright": "Unexpected expenses strain resources. Prioritize essentials and seek relief options.",
        "reversed": "Debt relief or assistance arrives. Make a sustainable plan."
      },
      "health": {
        "upright": "Low energy or illness calls for rest and proper care.",
        "reversed": "Treatment helps and strength returns. Continue supportive habits."
      },
      "spiritual": {
        "upright": "A crisis of faith or feeling forsaken. Knock on the door of community.",
        "reversed": "Renewed faith and belonging. Gratitude rekindles warmth."
      }
    },
    "version": "1.0.0"
  },
  "RW-06-PENTACLES": {
    "name": "Six of Pentacles",
    "description": "A wealthy figure distributes coins to two kneeling supplicants, scales balanced in his other hand. In this Minor Arcana scene, giving and receiving mirror each other, and the subtle power of the hand that measures fairness is on display. The card considers generosity, dignity, and the currents of exchange that bind a community.",
    "keywords": {
      "upright": [
        "generosity",
        "reciprocity",
        "charity",
        "fairness",
        "support",
        "equity"
      ],
      "reversed": [
        "strings attached",
        "inequality",
        "debt",
        "dependency",
        "exploitation",
        "imbalanced giving"
      ]
    },
    "meanings": {
      "upright": "Resources flow in a just balance; give where it truly helps and receive with grace. Attend to the ethics of exchange.",
      "reversed": "Help may come with conditions or power imbalances. Reassess motives, boundaries, and terms."
    },
    "category_meanings": {
      "love": {
        "upright": "Mutual care and practical support. Each partner’s needs matter.",
        "reversed": "One-sided effort or control through favors. Restore reciprocity."
      },
      "career": {
        "upright": "Mentorship, fair pay, or bonuses. Advocate for equity.",
        "reversed": "Favoritism or unpaid labor disguised as opportunity. Set clear agreements."
      },
      "finance": {
        "upright": "Donations, grants, or settling debts. Budget with generosity and discernment.",
        "reversed": "Loans become burdensome or help has hidden costs. Read the fine print."
      },
      "health": {
        "upright": "Accept help from practitioners, friends, or community. Balanced self-care heals.",
        "reversed": "Overgiving drains vitality. Prioritize your own wellbeing."
      },
      "spiritual": {
        "upright": "Service as practice; karma balances through sincere giving.",
        "reversed": "Performative charity or martyrdom. Offer quietly and from the heart."
      }
    },
    "version": "1.0.0"
  },
  "RW-07-PENTACLES": {
    "name": "Seven of Pentacles",
    "description": "A gardener pauses, leaning on his tool, contemplating a vine heavy with pentacles. The Minor Arcana here honors patience and appraisal: a breath between effort and outcome, where choices ripen. It is the still moment of counting seasons, measuring return, and deciding what to prune or tend.",
    "keywords": {
      "upright": [
        "patience",
        "assessment",
        "long-term growth",
        "investment",
        "perseverance",
        "harvest"
      ],
      "reversed": [
        "impatience",
        "poor returns",
        "burnout",
        "misallocation",
        "stagnation",
        "reevaluation"
      ]
    },
    "meanings": {
      "upright": "Evaluate progress with clear eyes. Continue nurturing what’s fruitful and adjust what isn’t; slow work will yield.",
      "reversed": "Effort is not paying off or motivation wanes. Change methods, timelines, or goals to restore vitality."
    },
    "category_meanings": {
      "love": {
        "upright": "A relationship grows slowly but surely. Honest check-ins strengthen roots.",
        "reversed": "Waiting without movement. Revisit expectations or release what no longer grows."
      },
      "career": {
        "upright": "Long-range projects mature; a review guides your next phase.",
        "reversed": "A plateau or dead-end tasks. Redirect energy to higher-yield work."
      },
      "finance": {
        "upright": "Savings and investments accrue over time. Stay patient and diversified.",
        "reversed": "Lackluster returns or scattered efforts. Rebalance and set realistic horizons."
      },
      "health": {
        "upright": "Steady habits gradually improve wellbeing. Track and refine.",
        "reversed": "Frustration with a plateau. Adjust routine or seek new guidance."
      },
      "spiritual": {
        "upright": "Cultivate practice like a garden; consistency deepens insight.",
        "reversed": "Routine without meaning. Reconnect with intention or try a new approach."
      }
    },
    "version": "1.0.0"
  },
  "RW-08-PENTACLES": {
    "name": "Eight of Pentacles",
    "description": "An artisan sits at his bench, carving pentacle after pentacle with focused care, while a modest town lies in the distance. The Minor Arcana’s earth becomes devotion to craft: repetition as refinement, attention as love. Here, mastery is a path walked one careful step at a time.",
    "keywords": {
      "upright": [
        "skill-building",
        "craftsmanship",
        "diligence",
        "apprenticeship",
        "focus",
        "practice"
      ],
      "reversed": [
        "perfectionism",
        "monotony",
        "distraction",
        "cut corners",
        "boredom",
        "plateau"
      ]
    },
    "meanings": {
      "upright": "Dedicate yourself to learning and polishing your skills. Quality emerges from mindful repetition and pride in the work.",
      "reversed": "The grind dulls your spirit or standards slip. Re-engage with purpose, seek mentorship, or vary methods."
    },
    "category_meanings": {
      "love": {
        "upright": "Show love through consistent, thoughtful actions. Small efforts, repeated, become devotion.",
        "reversed": "Work or routine overshadows romance. Make intentional time and attention."
      },
      "career": {
        "upright": "Training, certification, or a portfolio grows. Your craftsmanship becomes your signature.",
        "reversed": "Busywork without growth or sloppy output. Raise standards and prioritize learning."
      },
      "finance": {
        "upright": "Earnings increase through skill and consistency. Invest in tools or education.",
        "reversed": "Mistakes or inattention cost money. Slow down and check your work."
      },
      "health": {
        "upright": "A steady routine yields incremental gains. Track progress and celebrate small wins.",
        "reversed": "Overtraining or boredom threatens adherence. Adjust volume or find a coach."
      },
      "spiritual": {
        "upright": "Discipline deepens practice; ritual becomes alive through attention.",
        "reversed": "Going through the motions. Reignite curiosity and heart."
      }
    },
    "version": "1.0.0"
  },
  "RW-09-PENTACLES": {
    "name": "Nine of Pentacles",
    "description": "In a sunlit garden heavy with grapes, a finely robed woman stands poised, a hooded falcon perched on her gloved hand. A small snail crosses the path, reminding that luxury took time to cultivate. The Minor Arcana here celebrates self-sufficiency, refinement, and the quiet pleasure of enjoying the harvest of your own careful tending.",
    "keywords": {
      "upright": [
        "independence",
        "self-sufficiency",
        "luxury",
        "grace",
        "boundaries",
        "discernment"
      ],
      "reversed": [
        "overindulgence",
        "dependence",
        "isolation",
        "impostor syndrome",
        "entanglement",
        "insecurity"
      ]
    },
    "meanings": {
      "upright": "You stand in the results of sustained effort — autonomy, comfort, and confident ease. Savor what you’ve created and keep your standards high.",
      "reversed": "Comfort without contentment or reliance on others clouds confidence. Strengthen self-worth and disentangle from what undermines independence."
    },
    "category_meanings": {
      "love": {
        "upright": "Healthy independence enriches connection; single life feels abundant and whole.",
        "reversed": "Walls too high or clinging for security. Seek interdependence, not isolation or dependence."
      },
      "career": {
        "upright": "Professional success and respected expertise. Consulting or solo work thrives.",
        "reversed": "A golden cage or fear of visibility. Claim your accomplishments without apology."
      },
      "finance": {
        "upright": "Wealth management, fine purchases made wisely. Protect what you’ve grown.",
        "reversed": "Spending to soothe emptiness or tangled assets. Simplify and align values with money."
      },
      "health": {
        "upright": "Restorative care, quality nourishment, and stress relief elevate wellbeing.",
        "reversed": "Neglecting self-care despite means. Invest time in truly supportive routines."
      },
      "spiritual": {
        "upright": "Gratitude and elegance as spiritual practice. Beauty becomes prayer.",
        "reversed": "Comfort numbs insight. Choose depth over distraction."
      }
    },
    "version": "1.0.0"
  },
  "RW-10-PENTACLES": {
    "name": "Ten of Pentacles",
    "description": "Under an arch adorned with ten pentacles, an elder in patterned robes sits with two loyal dogs, while a couple and child pass within a courtyard of towers and ancestral emblems. This Minor Arcana culmination gathers wealth, home, and lineage into one tableau — the sense of belonging that spans generations and the duty that accompanies it.",
    "keywords": {
      "upright": [
        "legacy",
        "family",
        "inheritance",
        "home",
        "tradition",
        "long-term security"
      ],
      "reversed": [
        "family conflict",
        "financial disputes",
        "instability",
        "burden of tradition",
        "misaligned values",
        "fragmentation"
      ]
    },
    "meanings": {
      "upright": "Material cycles complete in lasting form: roots deepen, resources consolidate, and legacy comes into view. Think in decades and honor the line you are part of.",
      "reversed": "Wealth or family structures strain under competing values. Rework agreements and traditions to fit the living present."
    },
    "category_meanings": {
      "love": {
        "upright": "Long-term commitment, shared home, and supportive kin. A stable future is built together.",
        "reversed": "Tension over money, loyalty, or in-laws. Define boundaries and common values."
      },
      "career": {
        "upright": "Established institutions, retirement planning, or succession. Your work contributes to a larger legacy.",
        "reversed": "Office politics or stalled succession. Clarify roles and diversify paths."
      },
      "finance": {
        "upright": "Estate planning, property, and intergenerational wealth. Preserve and steward resources.",
        "reversed": "Inheritance disputes or risky dynastic bets. Seek impartial advice and transparency."
      },
      "health": {
        "upright": "Strong support network and focus on longevity. Family habits shape wellbeing.",
        "reversed": "Hereditary concerns or stress from obligations. Craft your own health patterns."
      },
      "spiritual": {
        "upright": "Connection with ancestors and lineage blessings. Rituals at home deepen meaning.",
        "reversed": "Breaking patterns that no longer serve. Honor the past while choosing a new way."
      }
    },
    "version": "1.0.0"
  },
  "RW-PAGE-PENTACLES": {
    "name": "Page of Pentacles",
    "description": "The Page of Pentacles belongs to the Minor Arcana’s suit of Earth. In the Rider–Waite image, a young figure stands in a flowering meadow beneath a golden sky, holding a single pentacle with both hands at eye level, studying it as if it were a map to the future. Behind him stretch freshly tilled fields, a small grove of trees, and distant blue-grey mountains — the path of learning leading from garden to peaks. His posture is careful and hopeful, suggesting the first tender sprout of skill, study, and opportunity taking root.",
    "keywords": {
      "upright": [
        "study",
        "apprenticeship",
        "manifestation",
        "opportunity",
        "focus",
        "new skills",
        "practicality",
        "ambition"
      ],
      "reversed": [
        "procrastination",
        "distraction",
        "immaturity",
        "missed chances",
        "short-term thinking",
        "lack of commitment",
        "restlessness"
      ]
    },
    "meanings": {
      "upright": "A fresh start in learning, work, or health asks for focus and steady effort. The Page of Pentacles invites you to set practical goals, study the craft, and plant seeds that will grow with patience.",
      "reversed": "Plans drift without follow-through, or enthusiasm scatters across too many distractions. Ground yourself, refine your method, and recommit to the basics."
    },
    "category_meanings": {
      "love": {
        "upright": "A sincere, down-to-earth connection grows through small gestures and reliability. Take time to learn each other’s needs and build trust step by step.",
        "reversed": "Immaturity or inconsistency hampers intimacy. Avoid mixed signals and invest in the simple practices that make love feel safe."
      },
      "career": {
        "upright": "Training, study, or an apprenticeship leads to tangible progress. Map out the steps, practice deliberately, and deliver dependable results.",
        "reversed": "Cut corners or scattered focus undermine your advancement. Strengthen foundational skills and stick to a workable plan."
      },
      "finance": {
        "upright": "Modest but real opportunities emerge — a side income, savings plan, or practical investment. Build slowly and keep records clean.",
        "reversed": "Impulse spending or poor planning leads to missed opportunities. Create a budget and honor it consistently."
      },
      "health": {
        "upright": "Commit to sustainable routines — nourishing food, gentle movement, and regular rest. Small, consistent actions compound into wellbeing.",
        "reversed": "Skipping the basics stalls progress. Reduce distractions and reestablish simple daily habits."
      },
      "spiritual": {
        "upright": "Learn by doing: grounded rituals, journaling, nature time. Bring spirit into the everyday and let practice cultivate insight.",
        "reversed": "Superficial dabbling leaves you unrooted. Return to simple, regular practices that reconnect body and earth."
      }
    },
    "version": "1.0.0"
  },
  "RW-KNIGHT-PENTACLES": {
    "name": "Knight of Pentacles",
    "description": "The Knight of Pentacles is the steadfast emissary of the Minor Arcana’s Earth suit. In the Rider–Waite scene, a heavy horse stands motionless over furrowed fields while the armored knight holds a pentacle like a compass for his labor. The sky is calm, the plume deep red, and nothing rushes — the land is prepared one careful row at a time. This is diligence made visible, the quiet oath of responsibility and method.",
    "keywords": {
      "upright": [
        "diligence",
        "responsibility",
        "reliability",
        "routine",
        "perseverance",
        "efficiency",
        "patience"
      ],
      "reversed": [
        "stagnation",
        "stubbornness",
        "monotony",
        "workaholism",
        "laziness",
        "inflexibility",
        "delay"
      ]
    },
    "meanings": {
      "upright": "Progress arrives through consistency, planning, and thorough work. The Knight of Pentacles favors dependable routines and craftsmanship over spectacle.",
      "reversed": "Either inertia and boredom stall momentum, or rigid perfectionism grinds the gears. Refresh your methods, or rekindle discipline where it has faded."
    },
    "category_meanings": {
      "love": {
        "upright": "Loyalty, steadiness, and practical care deepen a bond. Shared routines and promises kept build lasting trust.",
        "reversed": "Ruts, neglect, or overfocus on chores can mute romance. Rebalance effort with warmth and spontaneity."
      },
      "career": {
        "upright": "Reliable execution and attention to detail earn respect. Long-haul projects and operations work especially favor you now.",
        "reversed": "Micromanagement or lack of motivation causes delays. Adopt a sustainable pace and be open to small improvements."
      },
      "finance": {
        "upright": "Conservative strategies, steady saving, and long-term planning create stability. Favor proven methods over risky bets.",
        "reversed": "Either penny-pinching out of fear or lax tracking undermines security. Set clear procedures and stick to them."
      },
      "health": {
        "upright": "Steady habits—sleep hygiene, routine exercise, meal planning—bring gradual gains. Consistency is the medicine.",
        "reversed": "Monotony or burnout sap energy. Adjust the routine to be realistic and enlivening."
      },
      "spiritual": {
        "upright": "Discipline blesses devotion. Ground your practice in simple, repeated acts that align spirit with daily life.",
        "reversed": "Feeling spiritually stuck or going through the motions. Change the rhythm, reconnect with purpose, and re-root in sincerity."
      }
    },
    "version": "1.0.0"
  },
  "RW-QUEEN-PENTACLES": {
    "name": "Queen of Pentacles",
    "description": "The Queen of Pentacles sits within the lush garden of the Minor Arcana’s Earth suit. In the Rider–Waite image, she rests on an ornate throne carved with goats and vines, cradling a golden pentacle as tenderly as a child. Roses climb the stonework, a rabbit slips across the lawn, and distant mountains steady the horizon. Her gaze is warm and practical — the alchemy that turns resources into comfort, and prosperity into care.",
    "keywords": {
      "upright": [
        "nurturing",
        "practical wisdom",
        "abundance",
        "comfort",
        "resourcefulness",
        "domestic harmony",
        "generosity"
      ],
      "reversed": [
        "smothering",
        "self-neglect",
        "overcommitment",
        "materialism",
        "insecurity",
        "work-life imbalance",
        "overprotective"
      ]
    },
    "meanings": {
      "upright": "Grounded care and practical generosity create a fertile, welcoming life. The Queen of Pentacles teaches stewardship: tending the body, home, and resources with loving competence.",
      "reversed": "Overgiving, micromanaging, or neglecting yourself strains the garden you’re trying to grow. Restore balance, boundaries, and self-nurture."
    },
    "category_meanings": {
      "love": {
        "upright": "A stable, affectionate partnership thrives on acts of service and shared comforts. Create spaces where both of you can flourish.",
        "reversed": "Care becomes control, or responsibilities eclipse intimacy. Practice boundaries, ask for help, and rekindle warmth."
      },
      "career": {
        "upright": "Practical leadership and mentorship shine. You manage resources, teams, and timelines with calm, supportive authority.",
        "reversed": "Burnout from doing everything yourself or fussing over details. Delegate, simplify, and trust your systems."
      },
      "finance": {
        "upright": "Wise budgeting and sensible luxuries build security. Invest in home, health, and tools that sustain comfort.",
        "reversed": "Overspending on appearances or self-denial from anxiety. Recenter on true needs and long-term wellbeing."
      },
      "health": {
        "upright": "Nourishment, rest, and gentle rhythms support vitality. Fertility and body wisdom themes may be highlighted.",
        "reversed": "Overwork or stress unsettles the body. Prioritize replenishment and compassionate routines."
      },
      "spiritual": {
        "upright": "Embodied spirituality: kitchen witchery, garden altars, gratitude in daily chores. Holiness is found in tending life.",
        "reversed": "Disconnected from the body or the earth. Practice receiving care and honoring your worth."
      }
    },
    "version": "1.0.0"
  },
  "RW-KING-PENTACLES": {
    "name": "King of Pentacles",
    "description": "The King of Pentacles presides over the pinnacle of the Minor Arcana’s Earth suit. In the Rider–Waite deck he sits crowned upon a stone throne engraved with bulls, his robe woven with ripe grapevines. A sturdy castle rises behind him, gardens overflow at his feet, and he holds a scepter of authority and a pentacle of mastery. The scene is heavy with ripened abundance — the calm assurance of a life carefully built and well tended.",
    "keywords": {
      "upright": [
        "wealth",
        "stability",
        "leadership",
        "security",
        "discipline",
        "mastery",
        "success"
      ],
      "reversed": [
        "greed",
        "control",
        "rigidity",
        "materialism",
        "overcautious",
        "mismanagement",
        "status-obsession"
      ]
    },
    "meanings": {
      "upright": "Material mastery comes through patience, structure, and wise stewardship. The King of Pentacles builds lasting systems that support prosperity for himself and others.",
      "reversed": "Clutching at status, hoarding control, or shaky foundations reveal misaligned values. Reassess your relationship to power, wealth, and responsibility."
    },
    "category_meanings": {
      "love": {
        "upright": "A committed, protective partner invests in stability and shared goals. Security and sensual comfort deepen the bond.",
        "reversed": "Possessiveness or prioritizing work and status over intimacy strains connection. Lead with generosity of heart, not control."
      },
      "career": {
        "upright": "Executive competence, entrepreneurship, and strategic growth bear fruit. Mentor others and consolidate durable gains.",
        "reversed": "Authoritarian management, risk aversion, or mismanagement impede success. Humility and sound governance restore momentum."
      },
      "finance": {
        "upright": "Strong assets, sensible diversification, and long-term planning produce security. Consider legacy, philanthropy, and resilience.",
        "reversed": "Overleveraging, greed, or fearful hoarding destabilize finances. Return to fundamentals and values-driven choices."
      },
      "health": {
        "upright": "Stable routines and preventative care anchor wellbeing. Enjoy the body’s pleasures with mindful moderation.",
        "reversed": "Overindulgence or stress from heavy responsibilities affects health. Rebalance commitments and support the body."
      },
      "spiritual": {
        "upright": "Sanctify stewardship: build structures that serve community and the earth. Prosperity becomes a vehicle for purpose.",
        "reversed": "If matter eclipses meaning, reconnect with what wealth is for. Practice gratitude, service, and grounded humility."
      }
    },
    "version": "1.0.0"
  }
}